[{
  "_id": {
    "$oid": "631f68b6e35cd89dae09db9b"
  },
  "title": " JOOHYUNG KIM SECOND YOUNGEST WINNER ON PGA TOUR SINCE WORLD WAR II",
  "__v": 0,
  "content": "PGA Tour - Wyndham ChampionshipSouth Korean Joohyung “Tom” Kim closed with a 9-under 61 for a five-shot victory in the Wyndham Championship on Sunday, making him the second-youngest winner on TOUR since World War II.A marathon day because of storm delays turned into a sprint for Kim. He finished the third round in the morning and was two shots behind, and then shot 27 on the front nine to leave the rest of the field in his wake.No one came close the rest of the way.The victory gave Kim instant membership on the PGA TOUR, making him eligible for the FedExCup Playoffs that start next week. He is No. 34, assured of playing two Playoffs events and with a reasonable shot at getting to the finale at the TOUR Championship at East Lake.Sungjae Im, who finished seven holes Sunday morning to take the 54-hole lead, had a 68 and tied for second along with John Huh (67).Kim is the first PGA TOUR winner born after 2000. Jordan Spieth was 19 when he won the John Deere Classic for his first TOUR win.“I can't believe it,” Kim said, and then adding with a laugh, “I didn't know golf was this stressful.\"Japan Golf Tour – Japan PGA ChampionshipMikumu Horikawa returned to the winner’s circle after cruising to a three-stroke victory at the Japan PGA Championship, moving back into the Top 200 at World No.14029-year-old Horikawa carded a one-under-par 70 at the Grand Fields Country Club in Shizuoka for a final score of 15-under 269 ahead of Naoyuki Kataoka (272) and Taiki Yoshida on (273).\"I was not feeling nervous. For me, I just want to win every tournament that I tee up. So, I'm glad I managed to do it again today. I'm looking ahead to more challenges, and I want to replicate my form abroad and do well overseas like on the Asian Tour,\" said Horikawa.Horikawa has now won a title each season as he also triumphed in the JGTC Mori Building Cup Shishido Hills (now the BMW Japan Golf Tour Championship Mori Building Cup) in 2019 and the Casio World Open in November last year.Making his JGTO debut in 2015, Horikawa emerged as one of the most consistent players in the last two seasons when he finished sixth and seventh in 2019 and 2020/21 respectively on the Money Rankings.DP World Tour - Cazoo Open supported by Gareth BaleCallum Shinkwin strolled to a stunning four-shot victory at the 2022 Cazoo Open supported by Gareth Bale to claim his second DP World Tour title in style. Shinkwin jumps 147 places to World No.157.The 29-year-old carded six birdies and five bogeys on Sunday to reach 12 under par for the tournament and continue his love affair with The Celtic Manor Resort, where he has finished first, fourth and joint-eighth in his last three visits.The home fans may have expected to see a match play contest develop between overnight leader Shinkwin and Julien Guerrier, who were separated by one shot at the start of the day.But after a tense opening in which Guerrier fell two behind at the first before a two-shot swing on the second hauled him level, Shinkwin ran away from his rival, finding himself six clear after six holes.With the pair posting different numbers at each of the first 11 holes, there were minor twists and turns as the round progressed, but Shinkwin never relinquished his lead, despite a late charge from Scot Connor Syme piling on the pressure.Shinkwin signed for a closing 70 to comfortably add a second title to the Aphrodite Hills Cyprus Open crown he won in 2020.Syme finished alone in second on eight under thanks to a 68 which contained an eagle, three birdies and two bogeys, while Guerrier was in the large group in a tie for third on five under.Sunshine Tour - Vodacom Origins of GolfGeorge Coetzee won his first ever Sunshine Tour victory on the Vodacom Origins of Golf series, successfully defending his title earning four Ranking Points moving from World No.268 to 255.Coetzee claimed a two-stroke victory in the winelands for his fifth victory overall on the Vodacom Origins of Golf series, which started 15 years ago when he announced himself with a win on the series in his rookie season on the Sunshine Tour.It’s an achievement that now places him second on his own on the all-time list of winners on the series after Jean Hugo who has 11 titles.Coetzee withstood a strong challenge from England’s Joe Long and closed with a 67 to win on 21 under par. Long had closed to within a shot of Coetzee with three holes to play but then bogeyed the 18th as he took second place on 19 under with a final round of 67.Kyle Barker finished third on 15 under par in one of his best performances on the Sunshine Tour, signing for a 66.Asian Tour - Mandiri Indonesia Open 2022India’s Gaganjeet Bhullar claimed the Mandiri Indonesia Open title at Pondok Indah Golf Course to make history by becoming the first player to win the tournament on three occasions.He produced one of the finest rounds of his career to return a bogey-free seven-under-par 65 for a tournament total of 20 under, and a two-shot victory over England’s Steve Lewton, who carded a 64, and India’s Rashid Khan, in with a 68.Khan had started the day in front with Thailand’s Atiruj Winaicharoenchai but Bhullar was unstoppable and a man on a mission, making three birdies on the front, and four on the back – which included three on the trot from the 13th.Bhullar showed no sign of Sunday nerves and put on a putting masterclass, holing brilliant birdie putts and crucial par saves, to record his 10th win on the Asian Tour and first since 2018. He has also won more titles on Tour than any other player from his country.“I played like a champion tee to green and gave myself so many birdie opportunities,” said the 34-year-old Indian, who won this event in 2013 and 2016, with the latter win here at Pondok Indah.“I was riding high on confidence, hit the ball really good. It is a great week, I had a lot of positive memories having won this tournament two times previous, that was definitely on my subconscious mind. The goal was just to go out there and give my 100 percent.”Korn Ferry Tour - Utah Championship presented by Zions BankAndrew Kozan made five birdies on the back nine en route to an 8-under 63 and his first career Korn Ferry Tour victory, at the Utah Championship presented by Zions Bank.Kozan’s 63 finished tied the low round of the day (with Justin Suh and Zecheng Dou) at Oakridge Country Club. It was also Kozan’s career-low round on the Korn Ferry Tour by two strokes, with his previous low round being a 65 in the second round of the Astara Golf Championship presented by Mastercard back in February.Kozan made three consecutive birdies at Nos. 2, 3, and 4, canceled out another at the par-5 seventh with a bogey at the par-4 eighth, then birdied five of the first six holes on the back nine (Nos. 11, 12, 13, 15, 16) and took the outright lead at 21-under par. Kozan nearly made birdies at the par-4 17th and 18th, but needed neither in the end, as Suh, Ashton Van Horne, and local hero Patrick Fishburn all finished one stroke behind at 20-under par.Kozan, a 23-year-old in his first year out of Auburn University, began the day T13 and three strokes off the lead. While there have been bigger comebacks this season in terms of stroke deficits, no winner had entered the final round lower than T8.“It’s insane to think about, especially what we’ve gone through as a team the last few months,” Kozan said. “To come out on top this week is really special, and it just means a lot to have my wife here and everyone back home supporting me the whole week.“The time has definitely come. When it’s your time, it’s your time, and this was it.”Nordic Golf League – Gothenburg Open presented by Enkla Elbolaget on the MoreGolf Mastercard TourJeppe Kristian Andersen won his second title this season at the Gothenburg Open presented by Enkla Elbolaget on the MoreGolf Mastercard Tour. Andersen moves to World No.455 from 554.Challenge Tour - Vierumäki Finnish ChallengeGermany’s Velten Meyer shot a superb Sunday 65 to clinch his maiden Challenge Tour win in emphatic fashion at the Vierumäki Finnish Challenge. The 27-year-old, who shared the overnight lead with compatriot Marc Hammer, started with an eagle on the first hole and never looked back as he carded a bogey-free round seven under par final round to seal a five-stroke triumph, courtesy of a 26-under total.Meyer’s impressively calm performance belied the fact he was playing in a leading group on the final day for the first time on the Challenge Tour.“It feels amazing” he said.  “Obviously I’m very happy to come out on top. I think it can open a lot of doors, we play on the Challenge Tour to move up to the DP World Tour and this is a great help for my rankings.”“At the end of the day it is just another round of golf and either you are going to play well or not and thankfully I played well today.”EuroPro Tour - The Dell Technologies ChampionshipJames Allan finessed his way to victory for the second time this year; the Englishman has catapulted back to the throne of the Order of Merit.When James Allan captured his maiden PGA EuroPro Tour title at Harleyford Golf Club, a sense of awe – and relief – casted over his character.Allan has been a member of the EuroPro Tour for several years, and he came agonisingly close to conquering this supremely talented field prior to his triumph in the Cubefunder Shootout.“I felt really nervous today, a lot more than I did for the final round at Harleyford,” he tells us after his sublime victory at Mannings Heath Golf & Wine Estate this afternoon.The overriding question would be why? Why would he feel such nerves after already being crowned champion?Well, the answer to that question is straightforward: there was a lot more riding on this tournament.Any champion of the 2022 season is fundamentally aware that another victory would most likely result in qualification to the Challenge Tour.PGA Tour Canada – Québec OpenFor the second consecutive week there was a wire-to-wire winner on PGA TOUR Canada. Ryan Gerard accomplished the feat Sunday in the Québec Open at Club de Golf Le Blainvillier. The former University of North Carolina star capped off his four rounds by finishing 16-under, winning the tournament by one stroke over Thomas Walsh.It was only the second wire-to-wire finish on PGA TOUR Canada since 2017. The other, however, came just seven days ago. Noah Goodwin won the Sotheby’s International Realty Canada Ontario Open in identical fashion.“It was a really cool experience. I just really tried to stay patient and stay calm out there today,” Gerard said. “I knew I was leading by quite a few at one point, but I just tried to take it one shot at a time. You never know what can happen.”Walsh managed to make things challenging for Gerard. Walsh had an eagle on No. 2 and picked three birdies in moving to 15-under overall through 11 holes. That’s when the wind picked up, and Walsh wound up playing even-par the rest of the way.“I didn’t think catching Ryan was going to happen,” Walsh said. “I played with him [Saturday], and the kid is a stud. So, I just wanted to at least make him earn it.”Gerard had a fairly conservative round going early on. He had birdies on No. 5 and No. 7. Difficulties came down the stretch, with bogeys on the ninth, 16th and 17th holes. It forced him to make a par on the 18th hole to avoid a playoff, which he did. It tightened the eventual margin of victory but failed to alter Gerard’s perspective.“You just really have to lock in and stay focused on your game. You can’t worry about what anyone else is doing,” said Gerard, who shot a 73 on Sunday. “You’re just focused entirely on what you need to be doing. Everything else is a distraction.”Before prevailing in his fourth tournament as a professional, Gerard missed the cut at the Osprey Valley Open presented by Votorantim Cimentos - CBM Aggregates. He tied for 26th at the Sotheby’s International Realty Canada Ontario Open last week and finished in an 18th-place tie at the Prince Edward Island Open. The 23-year-old from Raleigh, North Carolina, earned conditional status with a 15th-place finish at the Qualifying Tournament in Weston, Florida, in February.Gerard credits his victory here to playing three solid rounds to give himself a big enough lead going into Sunday.",
  "date": "8TH AUGUST 2022 | 04:00 PM",
  "description": "South Korean Joohyung “Tom” Kim closed with a 9-under 61 for a five-shot victory in the Wyndham Championship on Sunday, making him the second-youngest winner on TOUR since World War II. Kim moves to a career-best of World No.21",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/a05b70fd-73cb-4a9b-9215-130fe57dcbcb/JHKim.jpg"
},{
  "_id": {
    "$oid": "631f68b9e35cd89dae09db9d"
  },
  "title": "IMPORTANT ANNOUNCEMENT STATEMENT FROM OFFICIAL WORLD GOLF RANKING CHAIRMAN PETER DAWSON",
  "__v": 0,
  "content": " Tuesday 12th July 2022STATEMENT FROM OFFICIAL WORLD GOLF RANKING CHAIRMAN PETER DAWSONOn 6 July 2022 Official World Golf Ranking received an application from LIV Golf for inclusion in its ranking system. Examination of the application will now commence.Peter DawsonChairman- Ends -",
  "date": "13TH JULY 2022 | 05:09 AM",
  "description": "On 6 July 2022 Official World Golf Ranking received an application from LIV Golf for inclusion in its ranking system. Examination of the application will now commence.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/79e6d210-e123-46cd-9a1a-8791e07e8080/SS1.jpg"
},{
  "_id": {
    "$oid": "631f68bfe35cd89dae09dbd9"
  },
  "title": " SCHEFFLER BECOMES THE 25TH PLAYER TO REACH WORLD NO.1",
  "__v": 0,
  "content": "In exactly 36 years of the Official World Golf Ranking Scottie Scheffler becomes the 25th player to reach No.1, the ninth player from the USA and the sixth youngest.Scheffler moved to the top of the Official World Golf Ranking with an emphatic victory at the 2022 WGC - Dell Technologies Match Play, his third title in his last five starts and six weeks after his first PGA TOUR victory.“I never got that far in my dreams,” Scheffler said in the trophy ceremony before choking up and wiping away tears, a rare show of emotion for the 25-year-old Texan. “I just play golf. I love competing. I'm happy to be out here, you know?”One year after losing in the championship match, Scheffler never trailed against Kevin Kisner, building a 3-up lead through six holes and giving him no chance to catch up. Scheffler closed him out with a par on the 15th for a 4-and-3 victory.He had to hold off a stirring fightback from Dustin Johnson in the semi-finals but victory rarely looked in doubt against Kisner as Scheffler banished the heartbreak of losing in the final at last year's event.Corey Conners finished third with a 3 & 1 victory over Johnson in the third-place match.Scheffler's ascent to the top of the world game comes just 42 days after he claimed his first US PGA Tour title, beating the previous record held by Tiger Woods by 210 days.\"I never really got that far in my dreams,\" said an emotional Scheffler. \"I never made it that far. I just love playing golf and I love competing and I'm just happy to be out here.\"I don't feel like number one in the world. I feel like the same guy I was four months ago and I hope that doesn't change.\"Life is good. Life has been good to me for the past few years. I'm just really pleased with today's results and I just couldn't be happier.\"Getting denied here in the final last year was definitely tough and it would have stung even worse having to do that two years in a row.\"I got off to a good start this afternoon, made some nice putts and just kept my head down and kept playing some good golf.\"",
  "date": "28TH MARCH 2022 | 03:44 PM",
  "description": "In exactly 36 years of the Official World Golf Ranking Scottie Scheffler becomes the 25th player to reach No.1, the ninth player from the USA and the sixth youngest.Scheffler moved to the top of the Official World Golf Ranking with an emphatic victory at the 2022 WGC - Dell Technologies Match Play, his third title in his last five starts and six weeks after his first PGA TOUR victory.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/108dcacc-74fd-49fb-a6d5-822778d2ec6a/SS%20Winner%20WGC.jpg"
},{
  "_id": {
    "$oid": "631f68c2e35cd89dae09dbde"
  },
  "title": " SMITH MOVES TO WORLD NO.6",
  "__v": 0,
  "content": "PGA Tour – The PLAYERS ChampionshipIn a dynamic conclusion to five days of bad weather and high drama, Cameron Smith one-putted eight of his last nine holes to win the PLAYERS Championship moving to a career best of World No.6.Leading by two on the par-3 17th hole, 135 yards to the hole on an island green, Smith split the difference in the 12 feet that separated the flag from the water. The ball ended up 4 feet away and the Australian made his record-tying 10th birdie of the round.Smith punched out from the pine straw right of the 18th fairway all the way into the water. After a penalty drop, his 60-yard wedge spun next to the hole to 3 feet for a bogey and a 6-under 66, giving him a one-shot victory over Anirban Lahiri of India.Lahiri, who started the final round with a one-shot lead, birdied the 17th and needed one more to force a playoff. He came up short of the green, and his pitch was below the cup all the way. He closed with a 69.Paul Casey shot 69 and was the victim of a horrible break on the 16th hole when he was in position to edge closer to the lead.Smith, who finished at 13-under 275, won for the second time this year, and the fifth time in his PGA TOUR career, and picked up $3.6 million from the $20 million purse, the richest in golf. He earned a staggering 600 FedExCup points.This was about more than money, more than the three-year exemption he earned to the four majors and a five-year exemption on the PGA TOUR.Sunshine and DP World Tour - MyGolfLife Open hosted by Pecanwood 2022Pablo Larrazábal claimed his sixth DP World Tour title as he defeated Adri Arnaus and Jordan Smith in a play-off at the 2022 MyGolfLife Open hosted by Pecanwood. Larrabal moved back in to the Top 200 at World No.116.The Spaniard had entered the day two shots off the lead at Pecanwood Golf and Country Club but soon hit the front and engaged in an enthralling battle with Arnaus and Smith at the top of the leaderboard.With the trio inseparable after 72 holes, they headed back to the 18th tee and although all three of them hit stunning approaches, Arnaus could not make his birdie putt and it was left to Larrazábal and Smith to go again.While Larrazábal found the fairway, Smith was in the rough and it was the 38-year-old who put his second to four feet for another birdie and the victory, with Smith three-putting from off the green for a bogey.The Spanish duo had carded rounds of 67 to finish the week at 22 under, where they were joined by Smith after a 65.PGA Tour of Australasia - TPS Hunter Valley, Hosted by Jan Stephenson & Peter O'MalleyAaron Pike won his third PGTA victory at the shortened TPS Hunter Valley over a three-hole playoff.Pike earned 6 Ranking points moving from World No 564 to 401.Professional Golf Tour of India - Mujib Borsho Chattogram Open 2022India’s Kshitij Naveed Kaul cruised to a comfortable six-shot win after a solid final round display of four-under 68 at the Mujib Borsho Chattogram Open jumping 203 spots to World No. 512.The 21-year-old Kaul, the overnight leader by five shots, drove home the advantage scoring eight birdies at the cost of two bogeys and a double-bogey in round four to total 19-under 269 at the INR 50 lakh event and register his third triumph on the PGTI. Kshitij collected a prize money cheque worth Rs. 8,08,250 that lifted him from 10th to first position in the TATA Steel PGTI Order of Merit.Bangladesh’s leading star Md Siddikur Rahman (71-66-69-69), who was overnight tied second, finished as runner-up at 13-under 275 after his last round of 69.Kshitij Naveed Kaul, who won his last PGTI event in November 2021, had an eventful front-nine as he made five birdies but dropped a bogey and a double-bogey. Kshitij’s front-nine featured two long conversions, two excellent bunker shots and a fantastic approach shot that landed within inches of the flag. He had nine one-putts on the front-nine.With his commanding lead still intact, Kaul closed out the match with a steady back-nine sinking three birdies against a lone bogey. He ended up with the day’s best score of 68 and birdies on all the four par-5 holes.",
  "date": "15TH MARCH 2022 | 08:00 AM",
  "description": "In a dynamic conclusion to five days of bad weather and high drama, Cameron Smith one-putted eight of his last nine holes to win the PLAYERS Championship moving to a career best of World No.6.Pablo Larrazábal claimed his sixth DP World Tour title as he defeated Adri Arnaus and Jordan Smith in a play-off at the 2022 MyGolfLife Open hosted by Pecanwood. Larrabal moved back in to the Top 200 at World No.116.India’s Kshitij Naveed Kaul cruised to a comfortable six-shot win after a solid final round display of four-under 68 at the Mujib Borsho Chattogram Open jumping 203 spots to World No. 512.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/79274e41-b0fb-4e5b-b1b0-b02791034fe7/CS1.jpg"
},{
  "_id": {
    "$oid": "631f68c6e35cd89dae09dbe5"
  },
  "title": " FOR THE FIRST TIME IN OWGR HISTORY ALL PLAYERS IN THE TOP 5 ARE UNDER THE AGE OF 30.",
  "__v": 0,
  "content": "The youth explosion in golf has hit new heights with the top five players in the world all under 30 for the first time in the history of the game - Rahm 27, Morikawa 25, Hovland 24, Cantlay 29 and Scheffler 25.The closest to the Top 5 being under the age 30 came in Week 4 2016 with the Top 4 ranked players - Spieth 22, Day 28, McIlroy 26, and Fowler 27.PGA Tour - Arnold Palmer Invitational presented by MastercardIn a final round that featured some of the toughest scoring conditions in four decades, Scheffler made key putts to save two unlikely pars, followed with a pair of lag putts and closed with an even-par 72 for a one-shot victory.Scheffler now has two PGA TOUR titles in the last month, having picked up his first victory at the WM Phoenix Open. He breaks into the Top 5 for the first time in his career.The scoring average was 75.48, by a fraction lower than it was a year ago. Only 10 players finished the tournament under par.Billy Horschel was the last player with a shot at catching Scheffler with a 30-foot birdie putt on the last hole that never really had a chance. Horschel shot 75 and tied for second along with Tyrrell Hatton (69) and Viktor Hovland (74).Hovland was still tied for the lead until catching a plugged lie in the front bunker on the 17th and having to two-putt from 50 feet on the fringe for bogey. Needing a birdie on the last hole to catch Scheffler, with whom he was paired, the Norwegian missed from 18 feet.In his final two holes Scheffler two-putted from 45 feet, the ball coming within inches of going in, for par on the 17th. And from deep rough left of the 18th fairway, he got it onto the green to just inside 70 feet. That putt stopped inches away, leaving a tap-in par and ultimately a big win at Arnie's place.DP World Tour - Magical Kenya OpenWu Ashun enhanced his record as the DP World Tour's most successful Chinese golfer as he became a four-time winner with victory at the 2022 Magical Kenya Open presented by Absa.The 36-year-old entered the final day at Muthaiga Golf Club four shots off the lead but never looked back after making four birdies in a row from the seventh, signing for a closing 65 and a 16 under par total making his way back into the Top 200 at World No.158.Canadian Aaron Cockerill, South African Thriston Lawrence and German Hurly Long finished four shots back but Wu's victory rarely looked in doubt on the back nine as he became the sixth different winner from a sixth different country on the 2022 DP World Tour.Wu became the third Chinese winner in DP World Tour history when he won the 2015 Volvo China Open and since then he has added wins in Austria and the Netherlands, with this win moving him two victories ahead of countryman Li Haotong.A two-time winner on the Japan Golf Tour, he will move up to sixth on the DP World Tour Rankings in Partnership with Rolex after triumphing in his 158th appearance with his wife and 13-week-old baby watching on in Nairobi.\"It's a big celebration, I'm so happy with my family here,\" he said.Asian Tour - International Series ThailandAmerican Sihwan Kim finally secured his first victory as a professional after over a decade long wait when he claimed the International Series Thailand at Black Mountain Golf Club. The American moves back into the Top 200 for the first time since April 2019, to World No. 189.The in-form 33-year-old, who has been in the final pairing on Sunday at three of the last six Asian Tour events, fired an inspired nine-under-par 63 to beat Thailand’s great hope of the future Phachara Khongwatmai by two strokes.Phachara, the overnight leader chasing his second Tour victory, had no answer to Kim’s round and shot a 68.South African Ian Snyman and Itthipat Buranatanyarat from Thailand finished two shots further back tied for third after rounds of 64 and 67 respectively.Sihwan Kim, who turned professional in 2011, has recorded eight top-four results on the Asian Tour since 2018, including two runner-up finishes.Today’s victory is the culmination of a fine run of form recently which has seen him finish joint fourth at the Blue Canyon Phuket Championship, fourth in the SMBC Singapore Open, and tied second in the Royal’s Cup last week.PGA Tour - Puerto Rico OpenRyan Brehm went out Sunday and ran away with the Puerto Rico Open for his first TOUR title and jumps 491 spots to World No. 282.The 35-year-old Brehm birdied five of the first 11 holes at windy Grand Reserve and beat Max McGreevy by six strokes.Three-strokes ahead entering the day, Brehm shot a 5-under 67 to finish at 20-under 268 in the make-or-break final start on a minor medical extension. He got the extension after he had to withdraw from the Zurich Classic last year because of COVID-19.“It might sound like Bill Belichick or Nick Saban here, but honestly, wasn’t thinking about the impact of my status or anything this week,” Brehm said. “I think that’s probably the real lesson here. I have people on my team that will do that for me. Really, I just need to put my head down and hit good golf shot after good golf shot. That’s my job and I’m going to trust people around me to do their job and they can take care of all those details for me.”Sunshine and Challenge Tour - Mangaung OpenOliver Hundeboll Jorgensen carded a six under par final round 66 to secure a dramatic victory at the Mangaung Open with a 21 under par total leaping from World No. 965 to 398.The Dane entered round three five shots off the pace but carded seven birdies and just one bogey in difficult conditions at Bloemfontein Golf Club to record a one-shot victory over South African duo Luke Jerling and Tristen Strydom, who shared second place on 20 under par.The 22-year-old started the final round slowly before a birdie at the tenth hole ignited a back nine of 31 to set the target in the clubhouse.Hundebøll watched on as players in the final three groups failed to convert birdie chances, and the Dane admitted he was not expecting to have his hands on the trophy when he signed his card.“It feels amazing,” he said. “I still don’t quite believe it to be honest, especially after the front nine. I managed to put together a strong back nine and the conditions felt like I was playing in Denmark. I’m used to these conditions and the key moment was making a birdie at the tenth hole after my bogey at nine. The putts started to roll in after that and it felt amazing.Professional Golf Tour of India - Glade One Masters 2022Manu Gandas of Gurugram coasted to a comfortable three-shot win at the Glade One Masters 2022 as he totaled eight-under 208 following his two-under 70 in the final round at the Glade One Golf Resort & Club.Chandigarh’s Harendra Gupta finished runner-up at a total of five-under 211 after setting a new course record of seven-under 65 in round four of the Rs. 40 lakh event. Harendra improved upon Aalaap I L’s previous course record of 67 set during round three on Thursday.The first two rounds of the second tournament of the 2022 TATA Steel PGTI season comprised nine holes each. The third and fourth rounds comprised 18 holes each. The tournament was played over a total of 54 holes. The par for the course in the third and fourth rounds was 72.Manu, the overnight leader by two shots, came up with four birdies featuring three long conversions on the front-nine to open up a mammoth seven-shot lead over the chasing pack. Gandas, the runner-up at last year’s inaugural edition, sank a birdie on the opening hole followed by three consecutive birdies from the seventh to the ninth. He landed his approach from 110 yards to within a couple of feet of the flag on the ninth.The 25-year-old Manu, who didn’t look at the leaderboard through the day, made bogey-birdie on the 10th and 11th before making pars all the way till the 17th. On the 18th, he found the water to drop a double-bogey.Manu, who bagged his second career title, collected the winning cheque worth Rs.6,46,600 which moved him up from sixth to first place in the PGTI Order of Merit.Alps Tour Golf – Red Sea Little Venice Open 202217 year old French amateur Oihan Guillamoundeguy, won the Red Sea Little Venice Open 2022 at Sokhna Golf Club (course B+C) with an impressive total score of -24 (65-64-63).The young golfer, coming directly from the Qualifying School held in November last year, maintained the lead since R2 and demonstrated to be able to compete at an incredible level.He had a strong start, scoring 3 birdies on the first 4 holes and finishing the front nine with 1 bogey and 1 eagle. Then, he faced the back nine with steady mind. He holed 3 birdies and another eagle for a daily total of -9. “This victory is incredible. I’couldn’t even believe it yet. The main goal was to stay focussed on my game and I managed to do it very well , I just scored 2 bogeys in 3 days! I putted very well throughout all the three rounds. Today, as always, I’ve been asking my father some advices on the greens and he helped me to hole some putts, too”.Guillamoundeguy, a first-time winner on a professional tournament (one of the youngest winner of all time), left Spaniard Jorge Maicas, 24 , 8 strokes back (-16, 68-66-66). Maicas scored a very solid 3rd round in 66 strokes with 7 birdies and just 1 bogey. He played consistently throughout the three days. “I’m very happy about how I worked on my game and this paid off with this performance here at Red Sea Little Venice Open 2022. I had a solid start which is what everyone wants from the first holes. Then I finished with 4 birdies in a row from 14th to 17th which is even greater”.Alps Tour Golf - New Giza Open 2022Tomas Bessa won the weather-shortened 2022 New Giza Open.Due to the extreme weather conditions, the 3rd round of the 2022 New Giza Open has been cancelled.After the final round started, the wind got stronger, more than expected. The ball couldn’t stay at rest on the greens and the game became unfair. Therefore, the Committee decided to cancel the final round and the results after the second round stood for the whole tournament.Therefore, the winner of 2022 New Giza Open is Portuguese Tomas Bessa, who scored a total of 131 strokes (-13) in 2 days (66-65).Bessa, 25 years old, is a first-time winner on the Tour since he started as a professional player back in 2019. He played consistently during the whole tournament and came out after a great second round thanks to 9 birdies and just 2 bogeys. “It’s awesome to see all the hard work paying off. I’ve been training myself a lot to play here on the Alps Tour and I’m very proud about my game and about the feelings I had on the course. It is very hard to win on the Alps Tour because there is plenty of great players and I’m really happy with this first title”.Two players are tied on the second place, just one stroke back: Spaniard Joel Moscatel and French amateur Julien Sale.",
  "date": "7TH MARCH 2022 | 03:00 PM",
  "description": "The youth explosion in golf has hit new heights with the top five players in the world all under 30 for the first time in the history of the game - Rahm 27, Morikawa 25, Hovland 24, Cantlay 29 and Scheffler 25.The closest to the Top 5 being under the age 30 came in Week 4 2016 with the Top 4 ranked players - Spieth 22, Day 28, McIlroy 26, and Fowler 27.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/cc6e183a-3ab6-44c5-a2e0-eb4a8b85a88e/News%20Page.png"
},{
  "_id": {
    "$oid": "631f68c8e35cd89dae09dbea"
  },
  "title": " STRAKA BECOMES FIRST AUSTRIAN TO WIN ON PGA TOUR",
  "__v": 0,
  "content": "PGA Tour - The Honda ClassicSepp Straka trailed by five shots entering the final round and tapped in for birdie in the rain on the final hole to beat Shane Lowry by one shot to become the first Austrian winner in PGA TOUR history. He shot a 4-under 66 on Sunday to finish at 10 under moving 93 spots to World No. 83.Lowry shot his third consecutive round of 67, his 9 under total for the week coming up one short. First-round leader Kurt Kitayama (68) was alone in third at 8 under, and Daniel Berger — who led by six shots with 19 holes left in the tournament — simply fell apart Sunday, his round of 74 leaving him 7 under for the week and three shots behind Straka.Lowry needed to make a 45-footer for birdie on the final hole to force a playoff. It missed, and with that, The Honda Classic had a new champion — one who came into the week ranked No. 176 in the world, has never been higher than No. 129 on that list, and whose claim to fame as a pro probably was being the first round leader at the Tokyo Olympics last summer.“The third round, I definitely didn’t have my best stuff,” Straka said. “I just hung in there and grinded out a good round. I hit the ball really nice today and really could take advantage.”The victory ensures that Straka — who played his college golf at Georgia — will play the Masters in April. His wife took a flight in to be at the course on Sunday, just in case, and Straka hadn’t even seen her until he got to the practice green before teeing off.Sunshine and Challenge Tour - Jonsson Workwear OpenJC Ritchie made it back-to-back wins after he secured a wire-to-wire six-shot victory at the Jonsson Workwear Open continuing his climb up the Ranking from the start of the year at World No. 304 to World No.151.The ten-time Sunshine Tour winner posted a one under par final round of 71 at Durban Country Club to reach 26 under par and claim his second victory in as many weeks after successfully defending his Bain’s Whisky Cape Town Open title last week.Ritchie admitted he found it much tougher today but remained resilient to record two closing birdies and finish six shots clear of Belgium’s Christopher Mivis, who at one stage came within touching distance of the lead, reducing Ritchie’s advantage to two after an eagle at the 14th hole.“It was tough out there today,” he said. “I’ve never played this golf course with this much wind before so I knew it was going to be different and the golf course showed its teeth today. I found it tough early on but luckily towards the end of the round I was able to figure it out and get the job done.“My girlfriend came up to me after the 14th hole and asked me if I wanted to know the scores,” he added. “She told me Mivis was 22 under and that surprised me. I had a game plan for the last three holes for the week and that was to make par at 16 and run, I felt like I could create a birdie opportunity at 17 and then 18 owed me one. I wanted to birdie it yesterday but found a bad lie in the bunker. Getting two birdies on the way home made it extra special.”Asian Tour - Royal's Cup 2022Chinese-Taipei’s Chan Shih-chang claimed a magnificent wire-to-wire victory in the Royal’s Cup today to secure his second victory on the Asian Tour in the space of four months moving to World No. 234 from 388.Chan closed with a four-under-par 68 to finish with an impressive winning total of 23 under for a three-shot win over Thailand’s Sadom Kaewkanjana and American Sihwan Kim.Sadom also returned a 68 while Sihwan fired a 70, in the second event of the season on the Asian Tour.Thailand’s Nitithorn Thippong and Bio Kim from Korea, finished three strokes further back, in a tie for fourth after rounds of 66 and 68 respectively.Thailand’s Jazz Janewattananond closed with a 65 in a group of players tied sixth to suggest the 2019 Asian Tour Order of Merit champion is starting to rediscover his best form.It looked like being a much closer finish to the US$400,000 event when Chan Shih-chang started the day with a one-shot lead over Sihwan before the American drew level with him on 21 under after nine holes.Professional Golf Tour of India - Gujarat Open Golf Championship 2022 presented by Gujarat TourismKarandeep Kochhar claimed the title on a dramatic final day at the Gujarat Open Golf Championship 2022 presented by Gujarat Tourism moving 134 spots to World No.441.Chandigarh-based Karandeep (64-75-69-70), who was overnight tied fourth and two off the lead, came from behind with a steady two-under 70 on day four to sign off with a 10-under 278 total and wrap up his fourth title at the Rs. 40 lakh event.Arjun Prasad (73-65-70-71), who like his good friend Kochhar was also overnight tied fourth, came within striking range of his maiden title before narrowly missing out. The Delhi golfer totaled nine-under 279 following a final round of 71 to secure his second runner-up finish on the PGTI.Ranjit Singh of Chandigarh, the joint overnight leader, submitted a card of 74 to claim third place at eight-under 280.Bengaluru’s M Dharma and Kapil Kumar of Delhi, the other two joint leaders after round three, shot scores of 75 to end the week in tied fourth place at seven-under 281.Twenty-two-year-old Karandeep Kochhar, who secured second place on the PGTI Order of Merit last year courtesy his two wins, made a slow start with two birdies and two bogeys on the front-nine as his approach shot on the eighth was the highlight having landed within six feet to set up a birdie.Alps Tour Golf - Ein Bay Open 2022Italian Stefano Mazzoli, 25, kept the overnight lead during the 3rd final round at Sokhna Golf Club battling head to head till the 17th hole with Irishman Conor Purcell  to claim the victory of the Ein Bay Open 2022, the first stage of the Alps Tour Season 2022.Mazzoli started his last round with 3 birdies on the first six holes but lost 2 shots on the 7th due to a double bogey. He came back on the back nine with 3 birdies on the last five holes. He scored just 3 bogeys and 1 double bogey during the whole tournament and saved strokes with 17 birdies and 1 eagle. He scored a total of 202 (69-65-68).“This is my second victory in Egypt (after 2020 Red Sea Little Venice Open) and the third on the Alps Tour (2021 Antognolla Alps Open). I’m very happy about my start, I’ve played very well during the week. Today I scored a bad double bogey on the 7th where I ended in the water hazard but then I came back soon. It was almost a matchplay between me and Conor until the 17th where we finished on the green with the second shot but I ended up making a birdie and Conor three-putted. I’m very happy with my start here for the first stage of the Tour”.Mazzoli earns a cheque of 5,800 euros and adds 6,525 points to lead the Order of Merit.The prize for the second place (3,940 euros) went to Irishman Conor Purcell, 24, who was in 6th place just 2 shots behind the leader after day 2.",
  "date": "28TH FEBRUARY 2022 | 04:00 PM",
  "description": "Sepp Straka trailed by five shots entering the final round and tapped in for birdie in the rain on the final hole to beat Shane Lowry by one shot to become the first Austrian winner in PGA TOUR history. He shot a 4-under 66 on Sunday to finish at 10 under moving 93 spots to World No. 83.JC Ritchie made it back-to-back wins after he secured a wire-to-wire six-shot victory at the Jonsson Workwear Open continuing his climb up the Ranking from the start of the year at World No. 304 to World No.151.Chinese-Taipei’s Chan Shih-chang claimed a magnificent wire-to-wire victory in the Royal’s Cup today to secure his second victory on the Asian Tour in the space of four months moving to World No. 234 from 388.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/78057992-b744-44e7-bd4c-8f5cc905336b/SS1.jpg"
},{
  "_id": {
    "$oid": "631f68cbe35cd89dae09dbec"
  },
  "title": " NIEMANN BECOMES FIRST PLAYER FROM CHILE TO BREAK INTO TOP 20",
  "__v": 0,
  "content": "PGA Tour - The Genesis InvitationalJoaquinn Niemann closed with an even-par 71 to become the first wire-to-wire winner of The Genesis Invitational in 53 years and the first player from Chile to break into the World Top 20.Staked to a three-shot lead, Niemann's margin was down to one when he made a 7-foot birdie on the eighth hole and PGA TOUR rookie Cameron Young sailed the green and made bogey.The 23-year-old from Chile chipped in for eagle on the par-5 11th to stretch his lead to five, and he held on for a two-shot victory over Open champion Collin Morikawa (65) and Young, whose last hopes ended with a bogey from the bunker on the 16th. Young shot 70.About the only thing Niemann missed was a chance to break the longest active tournament scoring record on the PGA TOUR. With two bogeys on the back nine, Niemann finished at 19-under 265, one short of the score Lanny Watkins had in 1985.Morikawa holed an eagle chip on the infamous and reachable 10th hole that one-hopped into the cup, and two late birdies gave him a chance. But he missed a 10-footer on the 18th in his bid to win and reach No. 1 in the world.Young, making only his 12th career TOUR start, was a runner-up for the second time this season. He also tied for second in Mississippi. Given the prestige of the tournament hosted by Tiger Woods, Young earned $1,068,000 for his tie for second. The purse was $12 million.As for Niemann, Riviera hasn't had a 23-year-old winner since Phil Rodgers in 1962, the tournament best known for Jack Nicklaus making his pro debut. Nicklaus tied for 50th and earned $33.33 that year.Sunshine and Challenge Tour - Bain's Whisky Cape Town OpenJC Ritchie successfully defended his Bain’s Whisky Cape Town Open title after holing a 25-foot birdie putt on the 72nd hole for a one-stroke victory at Royal Cape Golf Club moving from World No. 288 to 196.The South African, who defeated countryman Jacques Blaauw in a play-off last year, retained his crown by posting a four under par round of 68 to reach 18 under par, one clear of Belgium’s Christopher Mivis, who raced through the field on the final day to set the target at 17 under par.It was Ritchie, however, who prevailed by responding to back-to-back dropped shots at the 13th and 14th with birdies at the 16th and 18th.“Words can’t describe this feeling, it’s awesome,” he said. “For how I felt on the golf course the last two days and to come out on top, it means everything to me.“I didn’t feel great. I wasn’t hitting the ball my best up until about Friday, when I felt unbelievable about my game. Then on Saturday, the wind threw me off a little, made a couple of bad shots and started feeling uncomfortable. I went and did some important work yesterday and I managed to hit the important shots well and managed to give myself a chance down 18.Korn Ferry Tour - LECOM Suncoast ClassicByeong Hun An emerged from the 2022 LECOM Suncoast Classic with his first TOUR-sanctioned victory and first worldwide win since 2015. An followed Saturday’s 4-under 67 with a 2-under 69 in Sunday’s final round, taking him to 17-under par for the week and securing a one-stroke victory over four different players at T2.“It was a long day,” An said. “I was grinding all day. Last hole was a bit unlucky, lucky and unlucky at the same time, but I got the job done and that’s what you need to do. I missed a lot of putts today, but grinded it out and just did enough to win out there.“I finally realized I don’t need to play four days of perfect golf. I had a mediocre day yesterday and today and still got away with this. It gives me a lot of confidence.”An was one of several players who held at least a share of the lead in the final round, but a 55-footer for birdie at the par-4 16th, the toughest hole Sunday on Lakewood National Golf Club’s Commander course, gave An a two-stroke advantage over a host of chasers.",
  "date": "21ST FEBRUARY 2022 | 04:00 PM",
  "description": "Joaquinn Niemann closed with an even-par 71 to become the first wire-to-wire winner of The Genesis Invitational in 53 years and the first player from Chile to break into the World Top 20.JC Ritchie successfully defended his Bain’s Whisky Cape Town Open title after holing a 25-foot birdie putt on the 72nd hole for a one-stroke victory at Royal Cape Golf Club moving from World No. 288 to 196.Korean Byeong Hun An emerged from the 2022 LECOM Suncoast Classic with his first TOUR-sanctioned victory and first worldwide win since 2015.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/e3e19197-b899-48f6-bf79-eb3b40426b95/JN1.jpg"
},{
  "_id": {
    "$oid": "631f68cee35cd89dae09dbf0"
  },
  "title": " SCHEFFLER BREAKS INTO TOP 10",
  "__v": 0,
  "content": "PGA Tour - WM Phoenix OpenScottie Scheffler outlasted Patrick Cantlay on the third hole of a playoff in the WM Phoenix Open, making a 25-foot birdie putt for his first PGA Tour victory and enters the Top 10 for the first time at World No.9.Scheffler birdied four of the final six holes for a 4-under 67 to match Cantlay at 16-under 268 at TPC Scottsdale on another sunny, 80-degree day. Cantlay, playing a group ahead of Scheffler, had a bogey-free 67.Scheffler broke through in his 71st PGA TOUR start. Before Sunday, the 25-year-old former University of Texas star's biggest professional highlights were beating Jon Rahm in September in United States' Ryder Cup victory at Whistling Straits and shooting a 59 in the 2020 THE NORTHERN TRUST.Scheffler and Cantlay matched pars on the first two extra trips down 18, with both players hitting the fairway and green the first time and both scrambling to save par on the second.Scheffler missed a chance to end it in regulation when his 5 1/2-foot birdie try slid right. On the stadium par-3 16th, he left a birdie putt 2 inches short.DP World Tour - The Ras Al Khaimah ClassicRyan Fox claimed his second DP World Tour victory as he eased to a five-shot win at 2022 Ras Al Khaimah Classic moving back into the Top 200 from World No. 211 to 119.The Kiwi had turned a two-shot first-round lead into a three-shot advantage at the midway point and he doubled that heading into day four at Al Hamra Golf Club.He saw the gap trimmed to two just after the turn as Pablo Larrazábal made a move but Fox signed for a 69 that moved him to 22 under and gave him an ultimately comfortable victory.England's Ross Fisher finished alone in second, a shot clear of Spaniard Larrazábal, South African Zander Lombard and German Hurly Long.Fox's victory is his first in a 72-hole stroke play event on the DP World Tour having claimed the 2019 ISPS Handa World Super 6 Perth title to go with two European Challenge Tour victories.He becomes the second wire-to-wire winner of the 2022 season after Thriston Lawrence, with the South African lifting the trophy at the weather-affected 36-hole Joburg Open.Korn Ferry Tour - Astara Golf Championship presented by MastercardBrandon Matthews claimed his first Korn Ferry Tour  title at the Astara Golf Championship presented by Mastercard with birdie-birdie-eagle finish moving to a career best of World No. 252.Brandon Matthews’ eagle-three at the par-5 18th of Country Club de Bogota’s Lagos course capped a birdie-birdie-eagle finish and a one-stroke victory.Matthews’ first Korn Ferry Tour victory came in his 50th Tour start. The 2020-21 PGA TOUR Latinoamérica Order of Merit winner, Matthews began the final round in T3 position and reached 19-under par for the week, one stroke ahead of runner-up finishers Ryan McCormick and Ben Griffin, with a 5-under 66 Sunday.PGA Tour of Australasia - Vic OpenDimitrios Papadatos, 30, produced a perfect six-under Sunday round of 66 to finish one shot clear of playing partner Ben Campbell at 20-under to claim his fifth professional victory and spot in the 150th Open Championship this year.The fans at 13th Beach were treated to an exquisite display of golf from Papadatos and New Zealander Campbell as they both went bogey free and continually placed one another under pressure.It was most prevalent on the dramatic final hole when Campbell’s shot from the green side bunker rolled to roughly three feet to all but guarantee a birdie and throw down the gauntlet to Papadatos that he would need to make a birdie to secure victory.Sunshine and Challenge Tour - Dimension Data Pro-AmAlexander Knappe secured his first win for  five years by posting four bogey-free rounds at the Dimension Data Pro-Am jumping 185 spots to World No.275.The German was calmness personified throughout his closing four under par round of 68 on the Montagu course at Fancourt Golf Estate, birdieing the last for a 23 under par total and a one-stroke victory over two-time DP World Tour winner Dean Burmester, who finished second on 22 under par after missing a birdie chance on the 72nd hole.Knappe was clearly emotional after securing his third Challenge Tour victory and was overjoyed by keeping his card clean throughout the first event of the season.“I’m really speechless, actually,” he said. “I’m settling down now so I can speak a little bit better but when I shook hands with Daniel, I couldn’t even say thank you for the round or anything, nothing came out. It’s just incredible to win this tournament, it means a lot to me.All Thailand Golf Tour - Singha E-San Open21 year old Atiruj Winaicharoenchai, finished the final round 5 under par 67 to claim his first All Thailand Golf Tour title finishing with a total score of 20 under par 268. The young Thai moved from World No. 839 to 568.",
  "date": "13TH FEBRUARY 2022 | 04:00 PM",
  "description": "Scottie Scheffler outlasted Patrick Cantlay on the third hole of a playoff in the WM Phoenix Open, making a 25-foot birdie putt for his first PGA Tour victory and enters the Top 10 for the first time at World No.9.Ryan Fox claimed his second DP World Tour victory as he eased to a five-shot win at 2022 Ras Al Khaimah Classic moving back into the Top 200 from World No. 211 to 119.Brandon Matthews claimed his first Korn Ferry Tour  title at the Astara Golf Championship presented by Mastercard with birdie-birdie-eagle finish moving to a career best of World No. 252.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/d06d6c25-a22a-4b42-8d95-ce446ebc0094/SS1.jpg"
},{
  "_id": {
    "$oid": "631f68d0e35cd89dae09dbf7"
  },
  "title": " HOGE BREAKS INTO TOP 50",
  "__v": 0,
  "content": "",
  "date": "7TH FEBRUARY 2022 | 12:30 PM",
  "description": "Closing with a par for a 4-under 68 Tom Hoge surged past Jordan Spieth to win the AT&T Pebble Beach Pro-Am for first PGA TOUR victory. Hodge breaks into the World Top 50 for the first time to a career best World No.39.Harold Varner III holed a miraculous eagle putt from 92 feet on the par-five 18th at Royal Greens Golf & Country Club to win the PIF Saudi International powered by SoftBank Investment Advisers today and beat compatriot Bubba Watson by a shot.Nicolai Højgaard claimed his second DP World Tour title after holding off Jordan Smith in a roller-coaster final round at the 2022 Ras al Khaimah Championship presented by Phoenix Capital to win by four shots.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/6d3052a1-b837-4e47-82f3-87a1fe06e876/TH1.jpg"
},{
  "_id": {
    "$oid": "631f68d3e35cd89dae09dbfa"
  },
  "title": " 1.0 HOVLAND BREAKS INTO THE TOP 3 ",
  "__v": 0,
  "content": "DP World Tour - Slync.io Dubai Desert ClassicViktor Hovland came from six shots behind to earn his second DP World Tour and first Rolex Series title during the 2022 Slync.io Dubai Desert Classic moving from World No.5 to 3.He rolled in his fair share of putts from inside 10 feet, but it was a 25 footer at the eighth which initially proved he had the feel of the greens.After a three-putt at the 15th Hovland thought his chance at the title was over, but he rolled in successive putts of 35 feet at 16 for birdie, and a 33 feet for eagle at the par-four 17th after driving the green.At the last, he two-putted from 39 feet to secure a final-hole birdie and a spot in the play-off, where he triumphed with another birdie to best out Richard Bland.PGA Tour – Farmers InsuranceLuke List earned his first PGA TOUR victory with a birdie on the first playoff hole at Torrey Pines on Saturday, holding off Will Zalatoris well after sunset to win the Farmers Insurance Open.List began the final round five shots back of leaders Zalatoris and Jason Day, and had to wait nearly two hours after closing with a 6-under 66 to see if he had a shot for the first win in a career that began in 2013.“I really believed I could win on this course, and it’s a dream come true,” List said. “I told myself if I was in a playoff, I was going to make birdie.”Zalatoris missed the chance to secure his own first career victory when he barely missed an 8-foot birdie putt on the par-5 18th, forcing a playoff. After both players rescued their errant playoff tee shots from a fairway bunker, List spun an exceptional 131-yard wedge approach shot to within a foot of the cup.After List tapped in and Zalatoris missed his 13-foot birdie putt, List celebrated in the gloaming with his wife, Chloe, while he held their daughter, Ryann.“She's been telling me for a long time, ‘Daddy, I want a trophy,’ and I finally got one,” the 37-year-old List said after breaking through in his 206th tour start.Zalatoris and List finished regulation at 15-under 273, setting up the fourth playoff in the last 11 years at the Farmers. Zalatoris shot a nervy final-round 71, finishing with 12 straight pars.",
  "date": "31ST JANUARY 2022 | 01:33 AM",
  "description": "Viktor Hovland came from six shots behind to earn his second DP World Tour and first Rolex Series title during the 2022 Slync.io Dubai Desert Classic moving from World No.5 to 3.Luke List earned his first PGA TOUR victory with a birdie on the first playoff hole at Torrey Pines on Saturday, holding off Will Zalatoris well to win the Farmers Insurance Open.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/23bef0f1-5772-4d30-9cdd-830a0380618a/VH1.jpg?w=3147&h=2620&fit=clip&rect=0,0,3147,2620"
},{
  "_id": {
    "$oid": "631f68d6e35cd89dae09dbff"
  },
  "title": " PIETERS RETURNS TO THE TOP 50",
  "__v": 0,
  "content": "DP World Tour - Abu Dhabi HSBC ChampionshipThomas Pieters won his first Rolex Series title as a gutsy closing 72 handed him a one-shot victory at the 2022 Abu Dhabi HSBC Championship moving back inside the Top 50 to World No.31 from 69.The big-hitting Belgian hit the front on the first and never looked back, opening up a three-shot lead just before the turn at Yas Links and holding off the challenge of a high-class chasing pack on the way home.Rolex Series winner Rafa Cabrera Bello briefly caught him on the back nine but as those around him stumbled, Pieters kept his cool to finish at ten under, one clear of Spaniard Cabrera Bello and India's Shubhankar Sharma and two ahead of Frenchman Victor Dubuisson and Norwegian Viktor Hovland.Defending champion Tyrrell Hatton was then at seven under alongside fellow Englishmen James Morrison and Ian Poulter and Dane Jeff Winther, with Scotsman Scott Jamieson and Major Champion Adam Scott a further shot back.Pieters becomes the first Belgian to win a Rolex Series event and claims his sixth DP World Tour title just 77 days after he won his fifth at the Portugal Masters.\"Winning a Rolex Series, it's as good as it gets in Europe,\" he said. \"Hopefully this lists me, I'm not sure where, but I want to play all of the big tournaments and hopefully this gets me close.\"Top-50 is your strive point and when I jumped out maybe three years ago, I took it badly, but I'm happy to be back again.\"I feel like I've turned the corner and I'm playing really good golf. I'm really in control of my ball flight and it's nice to feel like that and making putts as well. My putting has improved massively and I felt like that's the thing that really kept me going on the weekend.PGA Tour - The American ExpressHudson Swafford won The American Express for the second time in five years, breaking a late tie with an eagle in a closing-round 8-under 64 jumping 105 spots to World No.61.Swafford beat Tom Hoge by two strokes on PGA West’s Stadium Course after beginning the day three strokes behind rookies Lee Hodges and Paul Barjon.Tied for the lead with fellow former Georgia player Brian Harman and Francesco Molinari at 20 under, Swafford pulled ahead with the eagle on the par-5 16th. From 198 yards, he hit to 8 feet on the iconic hole with large, deep bunkers lining the left side.Swafford then ran in a 20-foot birdie putt on 17, a par-3 hole called Alcatraz with an island green ringed by jagged rocks. He saved par on the par-4 18th with an 8-footer.The 34-year-old finished at 23-under 265 in the three-course event for his third PGA TOUR title. He also won in the desert in 2017 and took the 2020 Corales Puntacana Resort & Club Championship.Hoge shot a 68. The 32-year-old from Fargo, North Dakota, missed a chance to win his first title in his 201st career start.Hodges, the 26-year-old from Alabama making his 14th PGA TOUR start, shot a 70 to tie for third at 20 under with Harman (64) and Lanto Griffin (67).Molinari, the Italian star who won the 2018 Open Championship, bogeyed the 18th for a 68. He tied for sixth with Will Zalatoris (67) and Denny McCarthy (67).Asian Tour - SMBC Singapore OpenThailand’s Sadom Kaewkanjana secured the biggest title of his fledging career when he won the SMBC Singapore Open at Sentosa Golf Club becoming the highest current Ranked Thai player at World No.148, a career best.Sadom, the joint-overnight leader, fired a composed bogey-free 69 on the Serapong Course to finish on 13 under and beat Japan’s Yuto Katsuragawa and Joohyung Kim from Korea by three strokes.Katsuragawa returned a 68 while Kim wrapped up the Asian Tour Order of Merit title after signing for 69.Sihwan Kim, who started the day sharing the lead, carded a 73 to take fourth place.All four players booked their tickets to this year’s Open Championship at St Andrews as this week’s event is part of the Open Qualifying Series.Sadom produced another inspired level of golf today that confirmed his status as one of hottest young golfers in the region and a star of the future.The 23 year old was never really challenged on an extremely hot day. After Sihwan Kim made bogey on the first Sadom took the outright lead and did not look back. Birdies on six and seven saw him move three ahead and he calmly parred his way home and enjoyed the comfort of a three-shot lead playing 18.He picked up a cheque for US$225,000 and finished the year in second place on the Merit list, with US$378,972.PGA Tour of Australasia – Queensland PGA ChampionshipGold Coast’s Anthony Quayle twice had to drag himself up off the canvas to complete a two-stroke victory in an enthralling final day of the Queensland PGA Championship in Brisbane.Boasting a six-stroke lead through 54 holes at Nudgee Golf Club, talk at the start of the day centred around whether Quayle might match Ossie Moore’s 10-stroke record winning margin from 1986 yet just five holes in it was tied at the top.Quayle made a disastrous start when he double-bogeyed the opening hole and when Sydney’s Justin Warren made three birdies in succession from the second hole the margin was down to one.The wheels might not have completely fallen off but Quayle did have to take his shoes off when his approach to the par-5 fifth came up short and in the hazard, the resulting bogey bringing him back level with Warren at 10-under.In the blink of an eye his lead had vanished into thin air yet a brilliant 5-iron to the par-4 sixth turned momentum back in Quayle’s favour, his birdie from close range and Warren’s double bogey after finding the hazard long of the green restoring a three-shot buffer.The margin was back out to five by the turn after Warren made bogey at both eight and nine but just as Quayle settled again a new contender emerged in Louis Dobbelaar.The nearest threat would ultimately come from Daniel Gale (66) in the group ahead but when Quayle safely navigated the treacherous tee shot at the par-3 18th the 2021 Queensland PGA Championship was finally secured, good friend Jake McLeod storming the 18th green to celebrate with a bottle of champagne.“It was more stressful than I thought it would be but it was a lot of fun,” Quayle conceded after a roller-coaster closing 73.As Warren was landing bombs early on the front nine, rising star Louis Dobbelaar continued to stay in the fight and when he picked up birdies at 12 and 13 the margin was again back to two.But Dobbelaar’s charge also ran out of steam, a three-putt from close range at 15 handing Quayle a three-shot buffer with three holes to play.The nearest threat would ultimately come from Daniel Gale (66) in the group ahead but when Quayle safely navigated the treacherous tee shot at the par-3 18th the 2021 Queensland PGA Championship was finally secured, good friend Jake McLeod storming the 18th green to celebrate with a bottle of champagne.Korn Ferry Tour - The Bahamas Great Exuma Classic at Sandals Emerald BayAkshay Bhatia wasted no time in making an impact as a Korn Ferry Tour member, winning The Bahamas Great Exuma Classic at Sandals Emerald Bay with a final-round, 7-under 65, finishing two strokes clear of Paul Haley II at 14-under total. Bhatia earned 14 Ranking points moving from World No. 932 to a career best of World No. 374.In his first start as a Korn Ferry Tour member, Bhatia raised the trophy at the spry age of 19 years, 11 months and 19 days.The affable left-hander becomes the third player to win on the Korn Ferry Tour as a teenager, joining the company of PGA TOUR winners Jason Day and Sungjae Im.",
  "date": "24TH JANUARY 2022 | 11:35 AM",
  "description": "Thomas Pieters won his first Rolex Series title as a gutsy closing 72 handed him a one-shot victory at the 2022 Abu Dhabi HSBC Championship moving back inside the Top 50 to World No.31 from 69.Hudson Swafford won The American Express for the second time in five years, breaking a late tie with an eagle in a closing-round 8-under 64 jumping 105 spots to World No.61.Thailand’s Sadom Kaewkanjana secured the biggest title of his fledging career when he won the SMBC Singapore Open at Sentosa Golf Club becoming the highest current Ranked Thai player at World No.148, a career best.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/7daf57e7-c90d-484d-9f11-3959daae438a/TP1.jpg"
},{
  "_id": {
    "$oid": "631f68d9e35cd89dae09dc05"
  },
  "title": " MATSUYAMA JUMPS BACK INTO THE TOP 10",
  "__v": 0,
  "content": "PGA Tour - Sony Open in HawaiiHideki Matsuyama made up a five-shot deficit on the back nine and then won the Sony Open in Hawaii in a playoff with one of the best shots, a 3-wood into the sun to 3 feet for an eagle to beat Russell Henley jumping back into the Top 10 from World No.19“I got on a roll,” said Matsuyama, who shot 31 on the back nine while Henley made eight pars and a bogey. “I'm glad it came out this way.”Matsuyama hammered a driver on the par-5 18th in regulation to set up a two-putt birdie for a 7-under 63 and got into a playoff when Henley missed a 10-foot birdie putt and closed with 65.Back to the 18th for the sudden-death playoff, Matsuyama this time hit 3-wood off the tee with Henley in a fairway bunker. That left him another 3-wood, and he immediately held up his hand to shield the sun and search for the ball.He didn't need to see it. One of the larger Sunday galleries at Waialae erupted with cheers as the ball landed about 10 feet in front of the back pin and rolled out to 3 feet for the eagle.Henley, after having to lay up out of the sand, sent his lob wedge from 85 yards bounding over the green and he made bogey.At that point, it didn't matter. Matsuyama tapped in his putt for his second win this season. Both times, he finished with an eagle, only he needed this shot. His eagle at the ZOZO Championship in Japan gave him a five-shot victory.Matsuyama knew his Sony Open history. It was where Isao Aoki became the first Japanese player to win on the PGA TOUR in 1983 when he holed out from the fairway for eagle.“To follow him up, I'm over the moon,” Matsuyama said.They finished at 23-under 257. Matsuyama had his 13th consecutive round in the 60s dating to the final day at THE CJ CUP at Summit in Las Vegas.Kevin Kisner (64) and Seamus Power of Ireland (65) tied for third, four shots behind.Asian Tour – The Singapore InternationalJoohyung Kim claimed The Singapore International in a gripping sudden-death play-off against Thailand’s Rattanon Wannasrichan moving up the Ranking 49 places to a career best of World No.89.Korea’s 19-year-old prodigious talent holed a pressure-packed 14-foot birdie putt on the first extra hole, on the Tampines Course’s daunting par-five 18th, before Rattanon missed his birdie attempt from eight feet.The victory also saw Kim, overtake Australian Wade Ormsby on the Asian Tour Order of Merit with one more event remaining this season, next week’s SMBC Singapore Open.Kim and Rattanon, playing together in the final pairing, had finished the tournament tied on four under, after Kim closed with a 70 and Rattanon 72, setting the stage for a gripping sudden-death play-off.Thailand’s amateur star Ratchanon Chantananuwat, aged just 14 years old, was in contention for much of the day, making it a battle of the teenagers, took sole possession of third when he returned a 69 to finish two shots shy of the play-off.For the fourth day in a row, strong winds swept the challenging Tampines Course, but Kim handled conditions impressively showing maturity beyond his years.This was his second success on the Asian Tour, following his win in the 2019 Panasonic Open in India and when asked which win was the hardest, he said: “Has to be this one. Just because it’s a tough golf course you know, all the players played their heart out. I’m just very lucky to be on top. It was a grind today. I think it was a lot harder than the first one but definitely glad I finished on top.”He had looked to be on course to take the title in more comfortable fashion and held a one-shot lead playing the final hole in normal time, but Rattanon made an eight-foot birdie after a brilliant chip from behind the green while the Korean took two to get out of the greenside bunker, before making a tense par putt from three feet to force the tournament into a sudden-death play-off.PGA Tour of Australasia - Fortinet Australian PGA ChampionshipJed Morgan sauntered into the history books at the Fortinet Australian PGA Championship equalling the tournament record of 22-under par and breaking the championship’s biggest winning margin – previously eight shots held by Hale Irwin and Greg Norman – in beating Andrew Dodt by a remarkable 11.He is also the youngest winner of the tournament in 60 years, putting together rounds of 65-63-65-69 at a course he knows all too well as a five-year club member.tarting out with a nine-shot lead over fellow-Queenslander Dodt and soon making birdies at the first and third holes to stretch the buffer to 11, showing that there were no nerves. He made the occasional mistake – pulled tee shots at the par-three eighth and the 11th holes that cost him shots, and a flared second shot to the par-five 15th into the water, but he was generally able to recover. Notably at 15, he took his penalty drop beside the pond, chipped it up and then buried the putt from long range to save par.The only highlight he could not manage was a birdie to finish; his short iron shot stopped at five metres but his putt fell short. He had to be content with a tap-in for his first pro win and a huge fist pump for the crowd who included friends, family and club mates.",
  "date": "17TH JANUARY 2022 | 09:34 AM",
  "description": "Hideki Matsuyama made up a five-shot deficit on the back nine and then won the Sony Open in Hawaii in a playoff with one of the best shots, a 3-wood into the sun to 3 feet for an eagle to beat Russell Henley jumping back into the Top 10 from World No.19Joohyung Kim claimed The Singapore International in a gripping sudden-death play-off against Thailand’s Rattanon Wannasrichan moving up the Ranking 49 places to a career best of World No.89.Jediah Morgan sauntered into the history books at the Fortinet Australian PGA Championship by breaking the championship’s biggest winning margin – previously eight shots held by Hale Irwin and Greg Norman – in beating Andrew Dodt by a remarkable 11. Morgan jumps to a career best of World No.210.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/960c36f5-2476-4637-b33d-9cda15b33342/HM1.jpg?w=900&h=700&fit=clip&rect=0,171,1932,1503"
},{
  "_id": {
    "$oid": "631f68dbe35cd89dae09dc0e"
  },
  "title": " SMITH BECOMES 113TH PLAYER TO BREAK INTO TOP 10",
  "__v": 0,
  "content": "PGA Tour – Sentry Tournament of ChampionsCameron Smith completed the final round with a 3-foot birdie putt on the 18th hole for an 8-under 65 and a one-shot victory over Jon Rahm finishing at 34-under 258 top win the Sentry Tournament of Champions.Jumping 11 spots to a career best of World No.10 Smith becomes the 113th player to claim a Top-10 place in the OWGR since it was launched in 1986. He is the 9th Australian alongside, Stuart Appleby, Ian Baker-Finch, Rodger Davis, Jason Day, Steve Elkington, Greg Norman, Geoff Ogilvy and Adam Scott to achieve this status.Smith picked up his second OWGR eligible PGA TOUR victory and became the sixth player to have won at both Hawaii stops on the PGA TOUR. He won the Sony Open in Honolulu two years ago in a playoff.Rahm easily kept his No. 1 ranking and did little wrong in his return from the longest break of his professional career. He had a 20-foot birdie putt to tie for the lead on the 17th, his last good chance to catch Smith, that narrowly missed.On the par-5 closing hole, Smith came up just short of the green. His putt from 90 feet slowed to a stop about 3 feet from the hole. That meant Rahm had no choice but to hole a 50-foot eagle putt from just off the green, and it just missed on the high side.",
  "date": "10TH JANUARY 2022 | 01:54 PM",
  "description": "Cameron Smith completed the final round with a 3-foot birdie putt on the 18th hole for an 8-under 65 and a one-shot victory over Jon Rahm finishing at 34-under 258 to win the Sentry Tournament of Champions.Jumping 11 spots to a career best of World No.10, Smith becomes the 113th player to claim a Top-10 place in the OWGR since it was launched in 1986. He is the 9th Australian alongside, Stuart Appleby, Ian Baker-Finch, Rodger Davis, Jason Day, Steve Elkington, Greg Norman, Geoff Ogilvy and Adam Scott to achieve this status.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/cd5e75d0-c1c0-4afc-8c19-ffbef011d1b1/CM1.jpg?w=900&h=700&fit=clip&rect=82,213,2453,1908"
},{
  "_id": {
    "$oid": "631f68dee35cd89dae09dc10"
  },
  "title": " APHIBARNRAT MOVES BACK INTO THE TOP 200",
  "__v": 0,
  "content": "All Thailand Golf Tour - 22nd Singha Thailand MastersKiradech Aphibarnrat returned home to win a sixth title on the All Thailand Golf Tour at the season ending 22nd Singha Thailand Masters 2021. Aphibarnrat earned 5 Ranking Points moving back inside the Top 200 to World No. 187.As the overnight joint leader he closed with a final-hole eagle for a 68 to win on 15-under, one shot better than Phachara Khongwatmai, who also eagled the last hole for a 67 finishing second.Amateur Ratchanon Chantananuwat (66) and Varanyu Rattanaphiboonkij (68) finished tied for third on 17-under.14-year-old Chantananuwat, who met his top-5 target, won the best amateur award for the fifth time in six events this year.Professional Golf Tour India – TATA Steel Tour ChampionshipOlympian Udayan Mane came out best in the battle of nerves with a gritty last round of three-under 69 to win the PGTI’s season-ending TATA Steel Tour Championship and the 2020-2021 Order of Merit title.Mane (68-66-67-69) made six birdies, a bogey and a double-bogey in round four to end up with a tournament tally of 18-under 270 at the season’s showpiece event worth Rs. 1.5 crore in prize money which was played across the Beldih and Golmuri Golf Courses in Jamshedpur. The six -foot four-inch tall Pune-based golfer, who made a 12-feet pressure putt for victory on the last hole, made it a year to remember as he followed up his Tokyo Olympics appearance with the bragging rights of being No. 1 in PGTI’s money list with season’s earnings of Rs. 58,72,275.Two-time Asian Tour winner Rashid Khan (70-72-66-63) matched the tournament’s lowest round of nine-under 63 on Sunday to climb 10 spots and finish runner-up at 17-under 271. Delhi-based Khan, who made an eagle and seven birdies in round four, gave himself an opportunity to have a shot at the title and was even staring at a record fourth PGTI Order of Merit crown as his playoff with Udayan was looking possible at one stage.PGA Tour of Australasia - Gippsland Super 6Jack Thompson won his first professional title at the Gippsland Super 6 jumping 352 spots to a career best of World No. 566.Three bogeys in the space of five holes on day three put Thompson in jeopardy of missing the match play section altogether but once through he went on a giant-killing run to meet Jordan Zunic in the six-hole final.The pair couldn’t be separated across the six-hole course set-up at Warragul Country Club and went into a playoff, Thompson’s sublime pitch shot from the left of the green resulting in a short putt for par.Zunic also missed the green with his tee shot but missed his par attempt from 15 feet, allowing Thompson to complete the formalities and notch his first win as a professional.Runner-up to Anthony Quayle in a playoff at the 2020 Queensland Open whilst still an amateur, Thompson has contended regularly in PGA Tour of Australasia events since turning pro in February and felt an overwhelming sense of relief as he cradled the trophy.China Tour - Volvo China OpenZhang Jin won the Volvo China Open one shot ahead of former World No. 32. Haotong Li. Zhang earned 6 Ranking points moving from World No. 1193 to a career best of 629.",
  "date": "20TH DECEMBER 2021 | 02:00 PM",
  "description": "Kiradech Aphibarnrat returned home, winning a sixth title on the All Thailand Golf Tour at the season ending 22nd Singha Thailand Masters 2021. Aphibarnrat earned 5 Ranking Points moving back inside the Top 200 to World No. 187.Olympian Udayan Mane came out best in the battle of nerves with a gritty last round of three-under 69 to win the PGTI’s season-ending TATA Steel Tour Championship and the 2020-2021 Order of Merit title.Jack Thompson won his first professional title at the Gippsland Super 6 jumping 352 spots to a career best of World No.  566.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/473e15b9-6f37-47de-ba5f-7a02d3371d00/KA1.jpg"
},{
  "_id": {
    "$oid": "631f68dfe35cd89dae09dc12"
  },
  "title": " MATSUYAMA WINS ZOZO CHAMPIONSHIP BY FIVE SHOTS",
  "__v": 0,
  "content": "PGA Tour - ZOZO ChampionshipMasters champion Hideki Matsuyama had three birdies in five holes on the back nine and eagled the 18th for a five-stroke victory at the PGA TOUR's ZOZO CHAMPIONSHIP, moving to World No. 12 from 19.It was Matsuyama's first PGA TOUR win in his native Japan, although he's only had one previous attempt. In 2019, Tiger Woods won the inaugural ZOZO CHAMPIONSHIP, the first PGA TOUR event in Japan, and last year the tournament was moved to California due to COVID-19 restrictions.Matsuyama finished with a 65 and a 15-under total of 265 at Narashino Country Club. It was his fifth victory on the PGA TOUR. If t here was any doubt, Matsuyama hit a three-wood to about 12 feet with his second shot on the par-5 18th.Asked when he thought he had clinched his home tournament, Matsuyama said through an interpreter: \"Probably my second shot at 18, that was probably the clincher.\"Americans were tied for second at 10-under: Brendan Steele shot 66 and Cameron Tringale 69.Open champion Collin Morikawa had a final-round 69 and finished 10 strokes behind Matsuyama.Tokyo Olympics champion Xander Schauffele shot 68 and was at even par on the tournament, Rickie Fowler had his second consecutive 71 and finished at 3-over.European Tour – Mallorca Golf OpenJeff Winther carded a gritty final round of level par to win his first European Tour title at the 2021 Mallorca Golf Open. Winther moves up the Ranking 145 spots, breaking into the Top 200 for the first time at World No.162.The Dane had posted rounds of 62 on days one and three, sandwiching a 71 in tough conditions on Friday, and while the wind returned to Golf Santa Ponsa for the final 18 holes, Winther kept his cool.The 33-year-old recorded a closing 70 to stay at 15 under and win by one shot from home favourites Pep Angles and Jorge Campillo and Swede Sebastian Soderberg - who finished second for the second week in a row.Winther has carded three 62s - his lowest European Tour score - on Spanish islands on the 2021 Race to Dubai, with his two this week following his third round at the Gran Canaria Lopesan Open.He has shot five of his eight lowest European Tour rounds in Spain and the Balearic Islands will now forever loom large in his career as the place where he claimed his maiden win.A 2015 European Challenge Tour graduate who came through the Qualifying School in 2016, 2017 and 2018, he has been inside the top 100 on the Race to Dubai Rankings in Partnership with Rolex the past two seasons and will now rise to 37th, as well as into the top 200 on the Official World Golf Ranking for the first time.Challenge Tour – Challenge Costa BravaDaniel Hillier showed nerves of steel to birdie the final hole and claim his maiden European Challenge Tour title at the Challenge Costa Brava, courtesy of a one-stroke victory over his playing partner Marcus Helligkilde. Hiller jumps from World No. 391 to 246, a career best.The New Zealander started the day two shots behind overnight leader Ricardo Gouveia but managed to clinch a dramatic victory on the 72nd hole following a thrilling battle down the stretch with two-time Challenge Tour winner Helligkilde.Both Hillier and Helligkilde were on 18 under par coming into the 18th hole and the Swede’s closing par meant that Hillier had to birdie to avoid extra holes. After hitting his approach shot within four feet, the 23-year-old was left with a nerve-wracking putt which he duly converted for a six under 65, a 19 under total and a first professional victory outside of his native New Zealand.Hillier, a three-time winner on New Zealand’s Charles Tour, had enjoyed some impressive results in the 2021 campaign and even came close to earning a victory on the European Tour at the ISPS HANDA World Invitational presented by Modest! Golf Management, where he finished in a tie for third.“I’m pretty overwhelmed at the moment to be honest,” he said. “It’s been a pretty unreal week from the get go. We had some tough conditions to battle with but I managed to battle through that and probably had the round of my life in round three. To follow that up today and to hole a nice put on the last is just unbelievable, I can’t really believe I’m standing here right now.KPGA Korean Tour - Hana Bank InvitationalRichard Taehoon Lee won the Hana Bank Invitational earning nine Ranking Points. Lee moves up the Ranking to World No. 306 from 436.Nordic Golf League - Road to Europe Tour FinalSwedens Christopher Feldborg won a third NGL title this season at the Road to Europe Tour Final, securing a European Tour Challenge Tour card for the 2022 season.Feldborg moves up the Ranking 48 spots to a career best of World No. 366.Sunshine Tour - Blair Atholl Championship delivered by The Courier GuyIt took the near-perfect round for Luke Brown to win the Blair Atholl Championship delivered by The Courier Guy on Sunday and the 23-year-old duly produced a bogey-free 67 to claim his first Sunshine Tour title. Brown moves to a career best of World No. 374.Two shots off the lead and having never won on the main tour before, Brown also had to conquer one of the longest courses in the world and multiple winners like Ulrich van den Berg, Trevor Fisher Junior and Neil Schietekat.And a blustery, shifting wind was an added challenge.But Brown showed remarkable composure and tremendous skill as he compiled one of the few bogey-free rounds all week and collected five birdies as well to finish on 12-under-par.“They say your first one is the hardest to win and it was definitely very difficult today, but that was one of the best rounds of my life. It was breezy and difficult to choose the right club for these pin positions. But my ball-striking was amazing today, I hit all 18 greens in regulation, which is wonderful on the third longest course in the world.“My putting was also solid and if you keep the bogeys off your card on an amazing course like this, then you’re going to be tough to beat. I definitely had to stay patient, you might feel like you should be making more birdies, but it’s not that easy on this course. I tried not to look at what the others were doing,” Brown said.All Thailand Golf Tour - Singha Pattaya Open 2021Phachara Khongwatmai captured his 6th title on All Thailand Golf Tour after storming to a five-stroke victory at the Singha Pattaya Open, moving to World No. 513 from 694.Phachara, who carried a three-shot advantage into the final round, closed with a 68 to win on 20-under 260 while Sadom Kaewkanjana (70) was second on 15-under.The 22-year-old golfer from Hat Yai, Songkhla, who fired a course-record 59 in the first round at par-70 Burapha Golf & Resort, received 450,000 baht and five world ranking points for his 6th title on the tour.Sadom, who was looking for his third win in a row after two victories in Phuket, got 285,5000 baht. With that, he strengthens his position at the top of the money list with 1,182,100 baht after only four events.Defending champion Prom Meesawat, who won here four times, came in third after making a 69 for 10-under and earned 165,000 baht.“To be honest, I do not expect to win here at all. I just want to warm up for Thailand Open,” said Phachara.“I struggled a bit in the final round because of tougher conditions. With Sadom making a double bogey at 16th, I feel comfortable to play and win.”As an amaterur, Phachara won his first ATGT title at Hua Hin Open 2013 at the age of 14, the tour’s youngest-ever champion.Abema TV Tour - Delight Works JGTO FINALJunya Kameshiro won his first Abema TV Tour at the Delight Works JGTO FINAL moving from World No. 691 to 532.EuroPro Tour - The Matchroom Tour ChampionshipJamie Rutherford has won the 2021 Matchroom Tour Championship at Slaley Hall in a dramatic final day of the season that saw him also seal first place on the order of merit.Rutherford went into the day two off the lead and ninth on the order of merit and knew it’d take a gutsy performance to seal a place on next season’s Challenge Tour.The Knebworth Golfer has been one of the best performers of the season with the second-best stroke average and put together arguably one of the rounds of the season to match it.Rutherford went out for 35 but hit the turn with four straight birdies from 10-13 to move to -9 one clear of Jack McDonald and Calum Fyfe. He made a huge par save on 17 from a horrible lie before a bogey on 18 left him with a wait and McDonald eyeing a potential win or playoff.When it came down to it, McDonald’s approach into the tight 18th was short of the green leaving himself needing to chip in for the win or a par to make the playoff. McDonald made bogey and it was Rutherford who took home the win and a Challenge Tour card.",
  "date": "25TH OCTOBER 2021 | 03:05 PM",
  "description": "Masters champion Hideki Matsuyama had three birdies in five holes on the back nine and eagled the 18th for a five-stroke victory at the PGA TOUR's ZOZO CHAMPIONSHIP, moving to World No. 12 from 19.Jeff Winther carded a gritty final round of level par to win his first European Tour title at the 2021 Mallorca Golf Open. Winther moves up the Ranking 145 spots, breaking into the Top 200 for the first time to World No.162.Daniel Hillier showed nerves of steel to birdie the final hole and claim his maiden European Challenge Tour title at the Challenge Costa Brava, courtesy of a one-stroke victory over his playing partner Marcus Helligkilde. Hiller jumps from World No. 391 to 246, a career best.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/8316166f-9bfd-42c2-9d12-e2071dfb5233/HM1.jpg"
},{
  "_id": {
    "$oid": "631f68e2e35cd89dae09dc16"
  },
  "title": " MCILROY MOVES BACK INTO THE WORLD TOP 10",
  "__v": 0,
  "content": "MCILROY MOVES BACK INTO THE WORLD TOP 10PGA Tour – THE CJ CUP @ SUMMITRory McIlroy surged past Rickie Fowler and held off Collin Morikawa to win THE CJ CUP @ SUMMIT for his 13th PGA TOUR victory jumping back into the World Top 10 to World No. 8.McIlroy seized control with a 35-foot eagle putt from just off the green on the par-5 14th and then playing mistake-free down the stretch for a 6-under 66 and a one-victory.Fowler, who started the final round with a two-shot lead as he tried to end nearly three years without a victory, faded with a pair of three-putts and shot 71 to tie for third. The threat came from Morikawa, a member at The Summit Club, who shot 29 on the front to get in the mix and closed with an eagle for a 62.That forced McIlroy to play mistake-free after his big eagle putt on the 14th, and he never came close to a bogey in finishing at 25-under 263.“It is a big carrot,” McIlroy said of the 20 wins. “I didn't know it would be this week.”He went into the weekend nine shots out of the lead, made up plenty of ground with a 62 on Saturday and then pulled away by taking advantage of the scoring holes.It was similar to his first win on the PGA TOUR in 2010 at Quail Hollow. McIlroy was nine shots behind going into the weekend at that tournament and closed with rounds of 66-62 to win.Morikawa was watching from the balcony overlooking the 18th green to see if he would get a chance for extra holes, though it was asking a lot for McIlroy to drop a shot on the par-5 closing hole. McIlroy laid back off the tee, played short of the green and hit wedge to the back pin to assure a two-putt par and another trophy.European Tour - Estrella Damm N.A. Andalucía MastersMatt Fitzpatrick produced a brilliant, nerveless final round of 69 to conquer Real Club Valderrama and win his seventh European Tour title at the 2021 Estrella Damm N.A. Andalucía Masters moving to World No. 25 from 28.The Englishman entered the final round three shots off the lead but as many around him succumbed to the test of the 1997 Ryder Cup venue, Fitzpatrick made 15 straight pars to keep himself right in contention.Birdies on the 16th and 17th then put him in total control and he finished at six under, three shots clear of Australian Min Woo Lee and Swede Sebastian Soderberg.English trio Laurie Canter, James Morrison and Robert Rock, Swede Alexander Björk, Kiwi Ryan Fox, American David Lipsky and Paraguay's Fabrizio Zanotti finished at two under, with just 14 players under par.Canter led by three at the start of the day and was eight under after five holes but signed for a 76, while Soderberg led by two at six under stood on the 17th tee but dropped three shots in the final two holes in a 70, a score matched by Lee.Fitzpatrick claimed his first European Tour victory in his rookie season in 2015 and has only ever gone winless once in 2019 - when he finished second four times - finishing in the top 25 on the Race to Dubai in each of his seven seasons, including a second place finish in 2020.Japan Golf Tour - Japan Open Golf ChampionshipSouth Africa’s Shaun Norris won the Japan Open at Biwako Country Club with a record total of 19-under par, four strokes ahead of Japan’s Yuta Ikeda. Norris jumps back into the World Top 100 moving from World No.150 to 86.The 39-year-old claims his first Japan Open title and his sixth win on the Japan Golf Tour.Challenge Tour – Empordà ChallengeJulien Brun carded a final round 69 to secure his second title on the 2021 Road to Mallorca at the Empordà Challenge moving 46 spots to World No. 133.England’s Jonathan Thomson took the early clubhouse lead, posting a nine under par round of 62, but Frenchman Brun held his nerve down the stretch as he carded his third birdie of the day on the tenth hole and parred the remaining eight holes for a wire-to-wire victory.The 29-year-old added to his 2012 ALLIANZ Golf Open Toulouse Metropole title and his Open de Bretagne victory from earlier this season, with this win made more special with his father by his side as caddie.“This one is very sweet,” he said. “I was in the lead all week like the first one and it was very sweet to have my dad on the bag.“It was very nice to share that with him, that’ll be good memories for us and I’m sure he had a good time. I am very happy to share that with him.”Playing in the group ahead, Swede Jesper Svensson had joined Brun on 18 under par, but a bogey-bogey finish put paid to his bid for a maiden European Challenge Tour title as Brun held on for victory.“Some of the guys came from behind and shot some very low scores,” said Brun. “I thought that would be very difficult with the pin placements and course set up. We never really got it going in the last group so we couldn’t really feed off each other. It wasn’t easy but just to get it done that’s all that matters.Sunshine Tour - Blue Label ChallengeLyle Rowe won his first Sunshine Tour title in five years at the Blue Label Challenge at the Gary Player Country Club jumping 1396 spots in the Ranking to World No. 439.Rowe, one point off the lead going into the final round, shot a three-under-par 69 on Saturday for nine points, taking his overall tally over the four days to 33 points in the event that uses a modified Stableford scoring system.That was four points clear – the equivalent of two birdies – of second-placed Dylan Mostert and was enough to give Rowe his third Sunshine Tour title and his first since winning the Zimbabwe Open in April 2016.“I’ve been playing well for a while now and I just knew I needed to keep doing what I’ve been doing,” Rowe said. “It’s just a couple of shots every tournament and even though I didn’t make it easy for myself, I kept giving myself chances. I’ve gone back to the short putter, which gives me more feel, so I’ve been putting well and I’ve just been doing the right things mentally, controlling what I can on the course.”It was also the Humewood golfer’s first win on South African soil as his other triumph came in the Zambia Open in June 2014.Professional Golf Tour of India - Jaipur OpenKhalin Joshi turned the tables on final day to emerge victorious at Jaipur Open 2021 Presented by Rajasthan Tourism moving back into the World Top 500 to World No. 497.Khalin Joshi’s final round of three-under 67 proved good enough for him to turn the tables on nearest rival and fellow Bengalurean M Dharma and emerge victorious at the Rs. 40 lakh Jaipur Open 2021 Presented by Rajasthan Tourism being played at the par-70 Rambagh Golf Club (RGC).Joshi (61-66-64-67), who made a dramatic three-putt from four feet on the last hole to end the tournament with a bogey, won by one shot as he totaled 22-under 258 for the week.Khalin’s fifth career title ended his three-year long victory drought. The 29-year-old Joshi, who hails from the Karnataka Golf Association (KGA) course, overcame the disappointment of his runner-up finish in Delhi last week as he bagged a winning cheque worth Rs. 6,46,600 to move up from fifth to third in the PGTI Order of Merit. He made six birdies and three bogeys on the last day.Dharma (62-62-65-70), the overnight leader by two shots, slipped to second place with an even-par 70 on the last day as he struggled to hole putts. He ended the week with a total of 21-under 259.Nordic Golf League - MoreGolf Mastercard Tour Final at PGA Sweden NationalSebastian Petersen from Sjöbo Golfklubb won the MoreGolf Mastercard Tour Final at PGA Sweden National by two strokes ahead of Charlie Lindh.Petersen earned 4 Ranking points moving from World No.879 to 620.Alps Tour Golf - Emilia-Romagna Alps Tour Grand FinalVictor Garcia Broto from Spain held steady to stay at the top of the leader board for the three days and claim victory in a two-way play-off against the Italian amateur Riccardo Bregoli. Garcia Broto, who entered the Ranking for the first this year, moves to a career best of 706.“I’m really happy with the way I played. I’d like to thank the Alps Tour as this is my first season with them. I started as an amateur, turned pro in the middle of the season and this is a fantastic way to end”.The play-off on the 18th hole, saw Bregoli take the riskier right-hand fairway and, unfortunately, find the water. Garcia Broto took the safer route via the left-hand fairway, played a second safe shot and put his third just off the back of the green to chip on to be less than a metre from the hole. Bregoli’s fourth shot found the rough and he hit the green for five. Three putts to sink the ball, giving him triple bogey, he could only congratulate the Spanish player who sank his putt for par.A real home-crowd pleaser as witnessed by the supporters on the 18th green, Bregoli was obviously disappointed but remained positive :“This has been my home club for sixteen years since I started to play golf and I really appreciated playing here and to play well”.Modena Golf & Country Club member, Jacopo Vecchi Fossa received the trophy as winner of the 2021 OofM. He receives one of the 5 full cards on the Challenge Tour for next year.",
  "date": "18TH OCTOBER 2021 | 04:00 PM",
  "description": "Rory McIlroy surged past Rickie Fowler and held off Collin Morikawa to win THE CJ CUP @ SUMMIT for his 13th PGA TOUR victory jumping back into the World Top 10 to World No. 8.Matt Fitzpatrick produced a brilliant, nerveless final round of 69 to conquer Real Club Valderrama and win his seventh European Tour title at the 2021 Estrella Damm N.A. Andalucía Masters moving to World No. 25 from 28.South Africa’s Shaun Norris won the Japan Open at Biwako Country Club with a record total of 19-under par, four strokes ahead of Japan’s Yuta Ikeda. Norris jumps back into the World Top 100 moving from World No.150 to 86.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/2758f7b9-e4f1-4128-acc5-d4be967af921/RM1.jpg?w=3304&h=3700&fit=clip&rect=0,0,3304,3700"
},{
  "_id": {
    "$oid": "63208d49e35cd89dae0a3b3d"
  },
  "title": " BURNS BREAKS INTO THE WORLD TOP 20",
  "__v": 0,
  "content": "PGA Tour – Sanderson Farms ChampionshipSam Burns ran off four birdies in a six-hole stretch for a 5-under 67 to win the Sanderson Farms Championship for his second PGA TOUR victory this year breaking into the World Top 20 for the first time at World No. 18.Against a list of contenders looking for their first win, Burns showed what it takes at the Country Club of Jackson by playing flawlessly on the back nine until it didn't matter.He seized control with a 15-foot birdie putt on the par-3 13th, a 5-iron to 15 feet that set up a two-putt birdie on the next hole and then a perfect pitch from behind the green on the reachable par-4 15th for a tap-in birdie.Staked to a two-shot lead going down the 18th, he took a safe bogey from the greenside bunker to secure a one-shot win over resurgent Nick Watney and PGA TOUR rookie Cameron Young.Watney, coming off his worst season in more than a decade, closed with a 65 and had his best finish in more than three years.Young's hopes began to fade on the 14th with a clunker out of the rough into a fairway bunker that led to him having to make a 4-footer for bogey.Still, he made a slick up-and-down from off the 18th green for par that gave him a 68 and a share of second, which sets him up well for the season. That starts with playing next week in Las Vegas instead of having to go through Monday qualifying.“I love being in contention, I love feeling the nerves, so it was fun today. I enjoyed it, even though it might not have looked like it,” Young said. “I knew Sam was ahead of me and I had to make a couple and just didn’t, but I will another time.”Japan Golf Tour – Vantelin Tokai ClassicChan Kim won a sixth Japan Golf Tour title at the Vantelin Tokai Classic moving back into the Top 100 to World No.79 from 112.European Tour – Alfred Dunhill Links ChampionshipDanny Willett handed himself the perfect birthday present as he claimed a seventh European Tour win at the 2021 Alfred Dunhill Links Championship jumping to World No. 101 from 170.The Englishman carded a closing 68 on his 34th birthday to get to 18 under and win by two shots, adding to his record of victories at some of the European Tour's most iconic venues.Willett has won at Augusta National, Wentworth Golf Club and Crans-sur-Sierre to name but a few, and he can now add the Old Course at St Andrews to his list.The two time Rolex Series champion entered the day with a three shot lead and while he was briefly caught by Richard Bland, he produced a textbook display of front running on the back nine to hold off the challenge of Tyrrell Hatton and Joakim Lagergren and become the first player to win a European Tour event on their birthday since Ernie Els at the 2004 HSBC World Match Play Championship.This is the second time the 2016 Masters Tournament winner has tasted victory at this event, winning the team section alongside Jonathan Smart - who is back on the bag for him this week - in 2017.Team glory this week went to Michael Hoey and Maeve Danaher at 36 under, with Danaher becoming the first woman to win the event after the pair finished at 36 under.Challenge Tour - Swiss ChallengeMarcus Helligkilde claimed his second European Challenge Tour title in the space of seven weeks as he triumphed at the Swiss Challenge at Golf Saint Apollinaire moving to World No.143.The Dane started the day three strokes ahead of compatriot Nicolai Kristensen and Englishman Jonathan Thomson, who posted final rounds of 67 and 66 respectively, fueling a tight battle between the three players after the turn.Helligkilde started his final round with two birdies and battled with the conditions as he made consecutive gains on the 13th and 14th holes to move one stroke ahead of Kristensen and Thomson. He calmly finished his round with four straight pars to sign for a 69 and a 25 under par total.The 24-year-old, who gave himself an early present with his birthday coming this Tuesday, was delighted to secure a second victory on the Challenge Tour alongside his friend Kristensen.“It feels so great, playing with Nicolai today, we had a great battle,” he said. “Do you know what, we just had fun out there. It was so cool, and for him to finish second as well I am so happy for him.“I could definitely feel the pressure, it helps quite a bit when you can play with a mate in Nicolai, and I think we both enjoyed it and we both just did our best and I came out on top and I’m grateful for that.“I don’t have nerves of steel; I know I have nerves and I just accepted it as it is, and I just tried to do my best and enjoy it.”KPGA Korean Golf Tour - Hyundai Insurance KJ Choi InvitationalJeongwoo Ham won the Hyundai Insurance KJ Choi Invitational earning 9 Ranking pints moving from World No. 381 to 269.Nordic Golf League - Visby Open by Destination GotlandJarand Ekeland Arnoy moves to World No. 546 from 708 after winning the Visby Open by Destination Gotland.Abema TV Tour - TI Challenge in TojonomoriAmateur Riki Kawamoto earned 4 Ranking points at the TI Challenge in Tojonomori moving up the Ranking 247 spots to World No. 604.Sunshine Tour - Vodacom Origins of Golf – HumewoodDaniel Greene secured his first Sunshine Tour title in his 12th season on tour at the Vodacom Origins of Golf Series Humewood securing the playoff win over Tristen Strydom.Greene jumps 392 spots to World No. 697.Greene completed a solid par on the first playoff hole, on the par-four 18th, while Strydom could only get a bogey after he hit his second shot well right of the green. It was a bitter blow for the 24-year-old who was also chasing his first victory on tour, Strydom missing a shortish putt for par on the last hole of regulation play.Making the turn on two-under for his round, Greene then did exceptionally well to come home in level-par as the players faced the worst of the wind. The 36-year-old was helped by a crucial eagle on the par-five 11th.When Strydom bogeyed the 17th it meant they were all-square going up the last and Strydom wasted a golden opportunity to win as he was lying just off the green and decided to chip his third instead of putting.Steve Surry, Christiaan Basson and Malcolm Mitchell, who blazed through the last nine holes in four-under-par to finish with a level-par 72, all finished just one stroke off the lead on four-under-par, proving that the leaders cannot take anything for granted when conditions were as tough as they were at Humewood on Saturday.Big Easy Tour - Big Easy Road to #16 ServicesAmateur Noel Anderson carded a closing round of seven-under-par 65 on Wednesday to run out a two-stroke winner in the Big Easy IGT Challenge Tour’s Road to the Sunshine Tour #15 at Services Golf Club.Anderson, who spent four years at a Division II college in the United States, Flagler in Florida, but only resumed competitive golf with any kind of commitment about six months ago, made an eagle, seven birdies and two bogeys to head off the challenge of Therion Nel, Vaughn van Deventer and overnight leader Erhard Lambrechts by two shots.“I was actually quite calm about everything, considering I’ve never been in this kind of position before,” said Anderson. “I mean, my hands weren’t shaking, or anything. I really pretty much kept concentrating on what I was doing, and then, when I got to the last hole, I saw that I had a two-shot lead, and that made me feel pretty good.”He got off to a flyer in the final round, with a birdie on the first and an eagle on the second. He followed his next gain for the day with his first bogey on the sixth, but he was back on track with another birdie on nine to turn in four-under. Two more birdie-putts dropped on 11 and 12. A bogey on 14 could have made him nervous, but, instead, he followed it with birdies on 15 and 16 to get two shots ahead, which was where he stayed.",
  "date": "4TH OCTOBER 2021 | 12:59 PM",
  "description": "Sam Burns ran off four birdies in a six-hole stretch for a 5-under 67 to win the Sanderson Farms Championship for his second PGA TOUR victory this year breaking into the World Top 20 for the first time at World No.18.Chan Kim won a sixth Japan Golf Tour title at the Vantelin Tokai Classic moving back into the Top 100 to World No.79 from 112.Danny Willett handed himself the perfect birthday present as he claimed a seventh European Tour win at the 2021 Alfred Dunhill Links Championship jumping from World No. 170 to 101.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/63129679-ebfa-477d-b6a2-6000be412739/SB1.jpg"
},{
  "_id": {
    "$oid": "63208d4ce35cd89dae0a3b40"
  },
  "title": " SCHNEIDER BREAKS INTO THE WORLD TOP 200",
  "__v": 0,
  "content": "Marcel Schneider holed a 30-foot eagle putt on the 72nd hole to seal a one-stroke victory and his second title this season at the Open de Portugal at Royal Óbidos breaking into the Top 200 for the first time at World No. 190.The German was left needing a birdie on the par five final hole to force a play-off with Frenchman Frederic Lacroix, who had set the clubhouse lead at 18 under par following a sublime seven under par round of 65, however Schneider's eagle meant he went one better, signing for a two under par round of 70 to climb to 19 under par and top the leaderboard at Royal Óbidos Spa and Golf Resort.The 31-year-old showed real bravery to bounce back from a double bogey on the par five second hole to secure an enthralling victory and convert a 54-hole lead for the third time in his European Challenge Tour career.“I’m still pumped. I’m still out of words, it means a lot, for sure,” he said. “When the ball dropped I just thought ‘come on, that’s it’. I waited for it the whole day.“I made a huge mistake on the second hole and del Rey started birdie-birdie so that took the momentum off me. I told myself to hang in there, hit good shots onto the greens, stay patient on the greens but the putts just didn’t want to fall in. I had to stay patient until the last putt and I knew at the end that it was a super important one and I did it.”Schneider had focussed his efforts on the European Tour earlier in the year after finishing in the top five on the Road to Mallorca Rankings in 2020, however a victory in the Kaskáda Golf Challenge in July changed his outlook on the season.“My main focus at the start of the season was on the European Tour but I didn’t do that well,” he said.“I missed three tournaments because I was not able to play so I went to Czech because I knew the place and I always played well there. I just wanted a one-week experience on the Challenge Tour but I won it, so the whole schedule changed again.“With more opportunities on the Challenge Tour, I thought it was a better way to secure a European Tour card via the Challenge Tour and I’m lucky that it’s already done now.”Japan Golf Tour - Panasonic OpenKeita Nakajima, the current No. 1 amateur in the world, closed with a 4-under 68 and made par on the first playoff hole to beat Ryutaro Nagano and win the Panasonic Open on the Japan Golf Tour.Nakajima moves from World No. 379 to a career best of 208.Abema TV Tour - ISPS HANDA Hero ni nare! Challenge TournamentRyo Hisatsune earned 4 Ranking points at the ISPS HANDA Hero ni nare! Challenge Tournament moving from World No. 455 to 390.Big Easy Tour - Big Easy Road to #15 Riviera on VaalIan Snyman turned out to be a wire-to-wire winner in the Big Easy Road to the Sunshine Tour #15 at Riviera on Vaal moving to World No. 498 from 603.Snyman carded a closing level-par 72 to go with his first two rounds of five-under 67 each, and that gave him a one-stroke edge over Michael Kok, who closed with a four-under 68. Herman Loubser was third after his final-round 67 put him on eight-under for the tournament and two off the lead. Matthew Rushton and Michael-James Steyn rounded out the top five with totals of seven-under.After he had played so well in the first two rounds, it was a bit of a shock to his system when Snyman made bogeys on one and four in the final round. “I saw some places on the golf course that I hadn’t seen before,” he laughed. “And in the first two rounds, if I missed any greens, I was never more than a couple of inches off. Today, I had to chip, and with some of the lies I got around the greens, that wasn’t easy.”But for all that, Snyman stayed calm as Kok and Loubser, in particular, put the squeeze on him. But with no-one towards the top of the leaderboard able to keep at least one bogey off the card, Snyman was able to put together what turned out to be a winning run of consecutive birdies on six and seven, and, when he followed that with an eagle on eight, he was able to feel that he could win the thing.“I hit a good drive down the middle of wight,” said Snyman, “and I hit a long eight-iron in to the green. I actually hit it about 15 metres longer than usual, probably because of adrenalin, and I had about 13 metres to the hole. I read the line of the putt perfectly, and it went in.”All Thailand Golf Tour - Singha all Thailand ChampionshipSettee Prakongvech won the Singha All Thailand Championship by two shots after shooting a final round 67 on Sunday. He scored -10 over the four days on the par-72 Blue Canyon Country Club, Canyon course in Phuket.The Chon Buri native, who was five strokes behind the leader after three rounds, rolled in five birdies in a bogey-free round in the final of the three-million-baht tournament, promoted under the Sandbox Swing project.Settee received 450,000 baht for his second ATGT victory after his win at the Singha All Thailand Memorial 2019 and moved up to the top of the money list on 670,000 baht. He also earned five world ranking points.Atiruj Winaicharoenchai closed with a 68 to share second on 8-under with Suteepat Prateeptienchai (69) and Sarun Sirithon (70). They each took home 191,000 baht.",
  "date": "27TH SEPTEMBER 2021 | 12:10 PM",
  "description": "Marcel Schneider holed a 30-foot eagle putt on the 72nd hole to seal a one-stroke victory and his second title this season at the Open de Portugal at Royal Óbidos breaking into the Top 200 for the first time at World No. 190.Keita Nakajima, the current No. 1 amateur in the world, closed with a 4-under 68 and made par on the first playoff hole to beat Ryutaro Nagano and win the Panasonic Open on the Japan Golf Tour.Nakajima moves from World No. 379 to a career best of 208.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/e73b5544-a9dd-4573-b891-32a0743b09d5/MS1.jpg?w=315&h=210&fit=clip&rect=0,0,4850,3233"
},{
  "_id": {
    "$oid": "63208d4fe35cd89dae0a3b42"
  },
  "title": " HOMA WINS THIRD PGA TOUR TITLE",
  "__v": 0,
  "content": "PGA Tour - Fortinet ChampionshipMax Homa holed out from the rough from 95 yards for eagle on the par-4 12th to start a back-nine comeback and added three birdies for a 7-under 65 and a one-stroke victory in the PGA TOUR season-opening Fortinet Championship. Homa moves ten spots up the Ranking to a career best of World No.31.Three strokes behind Maverick McNealy with seven holes left, Homa followed the eagle with a birdie on the par-4 13th. The 30-year-old former University of California player tapped in for another birdie on the par-5 16th and ran in an 18-footer on the par-4 17th. He parred the par-5 18th to finish at 19-under 269.Homa won for the second time this year and the third time on the PGA TOUR. He won at Riviera in Los Angeles in February.Japan Golf Tour – ANA OpenScott Vincent fired a final-round 66 to claim the 2021 ANA Open with a total of 18-under 270, moving to career best of World N0.123. It was Vincent's second victory on the Japan Golf Tour in his last three tournaments. He also won the Sansan KBC Augusta in late August.Starting the final round tied for third and three strokes behind the leader, the Zimbabwean reeled off four birdies on his opening six holes to erase the deficit. Then his eagle on the par-5 ninth gave him the outright lead he would not relinquish.KPGA Korean Golf Tour - DGB Financial Group Irvine OpenKorean Sanghyun Park recorded a final total of 23-under 261, to beat Hanbyeol Kim by two strokes, moving back into the Top 200 at World No.167.The win marks Sanghyun Park’s tenth victory on the KPGA Korean Tour.European Tour - Dutch OpenKristoffer Broberg claimed his second European Tour title just under six years on from his first after holding off the chasing pack in a roller coaster final round to win the 2021 Dutch Open by three shots moving up the Ranking 535 spots to World No. 237.A brave and battling level par 72, which contained three birdies, three bogeys and some very important par saves, was enough to see Broberg return to the winner's circle for the first time since November 2015 when he won the BMW Masters.The Swede came into the fourth round with a commanding eight shot lead but his advantage had been cut in half by the time he reached the turn, as one birdie and a single bogey on the front nine saw him remain at 23 under par, while Matthias Schmid and Alejandro Cañizares both turned in 31.Broberg got his second birdie of the day at the tenth to extend his lead to five strokes with eight holes to play, but things started to unravel shortly thereafter as he did well to escape with just one dropped shot - and a two shot swing - at the 12th before finding the water at the 14th and carding another bogey there.But he kept his emotions in check and produced a hugely impressive up-and-down from the sand for par at the 15th to steady the ship before another par on the 16th gave him a two shot advantage with two holes to play.And he nervelessly holed his birdie putt from 13 feet at the 17th to stretch his lead to three before a par on the last saw him finish the tournament on 23 under par and secure the trophy.Challenge Tour - Hopps Open de ProvenceAlfie Plant came out on top in a three-way play-off to secure his first European Challenge Tour title at the Hopps Open de Provence.The Englishman started the day six shots behind overnight leader Lukas Nemecz before carding a fantastic five under par round of 67 to move to 17 under par alongside Nemecz and Germany’s Marcel Schneider at Golf International de Pont Royal.Plant put himself out of position off the tee on the first play-off hole but recovered brilliantly to make birdie and defeat Nemecz and Schneider, who could only make par.The 29-year-old was ecstatic to pick up the title in Provence after admitting he felt he was out of contention before he made the turn.“It feels amazing,” he said. “I don’t think it’s really sunk in yet to be honest but I’m over the moon. I felt like I was out of it on the first nine but just kept telling myself to keep playing my game, try to nick a few birdies here and there and you never know what can happen. I made two great birdies at 16 and 17 and also a great up and down at the last to get in the play-off. I can’t really believe it.”The Englishman, participating in his eighth consecutive Challenge Tour event, felt mentally and physically drained before the week but believes the lack of expectation allowed him to flourish in France.Sunshine Tour - Vodacom Origins of Golf - Mt EdgecombeLouis Albertse won the third leg of the Vodacom Origins of Golf Series at Mount Edgecombe Country Club Estate moving to World No. from 599.The 25-year-old began the final round with a share of the lead, and produced an impressive four-under-par 66 to finish on nine-under-par for the tournament and clinch victory by one stroke over CJ du Plessis (65).But, as well as Albertse played, a bogey on the par-four 16th left him needing pars on the tricky last two holes of The Woods course. Albertse negotiated the elevation changes and water bordering the 18th green with aplomb.“There are so many emotions, but it feels really good to have my first Sunshine Tour title. It’s never easy to win and the last nine holes when you’re going for your first win is particularly tough, but I tried hard to stay in the moment. The bogey on 16 was a bit unsettling, but I knew I was still 100% in it. I had been playing nicely the whole day and all I could do was give it my best.Abema TV Tour - PGM ChallengeKonosuke Nakazato won the PGM Challenge on the Abema TV Tour earning 4 Ranking points. The win takes Nakazato from World No. 903 to 623.EuroPro Tour - Castletown Golf LinksCalum Fyfe has won The Castletown Golf Links Championship on the Isle of Man to claim his first long-awaited victory on the PGA EuroPro Tour by four shots with the lowest overall winning score ever on the Tour. Fyfe moves up the Ranking to World No.680 from 1069.Fyfe (Trinifold Sports) has been there or thereabouts for some time on the Tour without ever seeing through his week to victory but that duck was finally broken as he signed for a final round of 64 (-8). Leading by two going into the final day, Castletown G0lf Links showed its teeth as the weather started to turn but Fyfe showed complete composure for his third 64 of the week in a display worthy of breaking a tour record.The Scotsman went around bogey-free as the wind picked up and made early birdies at one and three to pick up from where he left off yesterday before birdies at five, six, and seven put him five under through seven. Nothing seemed to get in Fyfe’s way even when in deep rough on at the 10th where he made birdie to extend his advantage. An eagle at the 12th was the icing on the cake as Fyfe ran away with it for his first win.Nordic Golf Legaue - Great Northern ChallengePeter Launer Baek earned 4 Ranking points after winning the Nordic Golf League’s Great Northern Challenge, moving 404 spots to World No. 736.Professional Golf Tour of India - J&K Open 2021 presented by J&K TourismDelhi’s Honey Baisoya ended a three-year title-drought with his determined display at the J&K Open 2021 Presented by J&K Tourism played at the Royal Springs Golf Course in Srinagar.There was a reversal in fortune for Baisoya (67-69-66-68), who was struggling for form through the season, as he totaled 18-under 270 for the week following his classy final round of four-under 68 to win by four shots. Honey skyrocketed from 85th to 22nd place in the PGTI Order of Merit after capturing his seventh title.Gurugram-based Veer Ahlawat (67-71-70-66) also made his presence felt in the last round with a score of 66 to finish second at 14-under 274 at the Rs. 40 lakh event.Patna’s Aman Raj (68-71-70-66) too shot a 66 on day four to take third place at 13-under 275.Honey Baisoya, the overnight leader by four shots, had a nervy start to the day as he made some tough par putts from five to six feet on the first six holes even as the likes of Angad Cheema and Kartik Sharma were piling on the pressure on the leader with early birdies.The 25-year-old Honey almost found the hole with his chip on the seventh but eventually tapped-in for his first birdie of the day. A 20-feet birdie conversion followed on the ninth as he made the turn with a two-shot cushion.Baisoya dropped his first bogey of the tournament when he three-putted on the 13th. That narrowed down his lead over Veer Ahlawat to just two shots. But Honey, who has interestingly won at another hilly course before in Shillong, made a final push for victory with birdies on the 14th and 15th as a result of some long conversions thanks to his new putter.Baisoya landed his approach from 134 yards to within a foot to set up another birdie on the 17th that all but sealed the deal for him.An elated Honey, who had just one top-20 from 10 starts in the season prior to this week’s event, said, “It still feels like a dream because till last week I was very low on confidence and not even sure of shooting an under-par score. So this win is all the more special.",
  "date": "20TH SEPTEMBER 2021 | 02:02 PM",
  "description": "Max Homa holed out from the rough from 95 yards for eagle on the par-4 12th to start a back-nine comeback and added three birdies for a 7-under 65 and a one-stroke victory in the PGA TOUR season-opening Fortinet Championship. Homa moves up the Ranking to a career best of World No.31.Scott Vincent fired a final-round 66 to claim the 2021 ANA Open with a total of 18-under 270, moving to career best of World N0.123. It was Vincent's second victory on the Japan Golf Tour in his last three tournaments. He also won the Sansan KBC Augusta in late August.Korean Sanghyun Park recorded a final total of 23-under 261, to beat Hanbyeol Kim by two strokes, moving back into the Top 200 at World No.167. The win marks Sanghyun Park’s tenth victory on the KPGA Korean Tour.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/41037d0b-2515-4af1-a533-03f012d2c6ab/MH1.jpg"
},{
  "_id": {
    "$oid": "63208d51e35cd89dae0a3b44"
  },
  "title": " HORSCHEL BACK IN THE WORLD TOP 20",
  "__v": 0,
  "content": "European Tour - BMW PGA ChampionshipBilly Horschel made a stunning closing birdie to fulfil one of his great golfing ambitions and win his first Rolex Series title at the 2021 BMW PGA Championship moving back into the World Top 20 to World No.18The American used to watch the event on television as a child and fell in love with Wentworth Golf Club when he finished in the top five on his debut two years ago.The 34-year-old said he would rank a win at European Tour HQ alongside a victory at The Players Championship - the event known by many as the 'fifth Major' - and he carded a closing 65 to finish at 19 under and beat Thailand's Kiradech Aphibarnrat, home favourite Laurie Canter and Welshman Jamie Donaldson by one shot.South African Christiaan Bezuidenhout finished at 17 under, a shot clear of England's Andrew Johnston and Justin Rose and Italian Francesco Laporta.In the race for an automatic place in Padraig Harrington's Ryder Cup team, a closing 72 was enough to see Bernd Wiesberger edge out Shane Lowry and join Jon Rahm, Tommy Fleetwood, Tyrrell Hatton, Rory McIlroy, Viktor Hovland, Paul Casey, Matt Fitzpatrick and Lee Westwood as the nine qualifiers.Sunshine Tour - Sunshine Tour InvitationalJacques Kruyswijk ended a five-year win drought and claim his second Sunshine Tour title in the Sunshine Tour Invitational at Centurion Country Club breaking into the World Top 200 at World No. 192.Kruyswijk closed with a 67, and then watched as Albert Venter, tied for the lead with him on 18 under par, bogeyed the last to hand him the title.Venter, who signed for a final round of 71, shared second place with Michael Palmer, who posted a 66, on 17 under par. Jaco van Zyl was next best on 16 under par with a closing 70.“It’s great to finally get it done, and even more special to do so at my home course,” said Kruyswijk, who last won in the 2016 Lions of Africa Cape Town Open but who since has had his resolve tested as he’s tried to get back into the winner’s circle.“This is the result of all the hard work I’ve put in over the last couple of years. You know, to be winless since 2016 was a big monkey on my back, and I’m so glad to finally be rid of that. I’ve got a fantastic team around me who have supported me since day one, and that’s made the difference for me. I’ve grown a lot in the last couple of years and I’ve learnt so much.”Challenge Tour - Big Green Egg German Challenge powered by VcGAngel Hidalgo posted four consecutive rounds of 68 to win the Big Green Egg German Challenge powered by VcG at Wittelsbacher Golfclub and claim his maiden European Challenge Tour title moving to a career best of World No. 242.The Spaniard started the day one shot behind overnight leader Lukas Nemecz but managed to storm ahead by posting five birdies on the front nine. Two bogeys on the back nine brought Road to Mallorca Number One Santiago Tarrio and Austria’s Nemecz into contention but making par on the last three holes was enough to secure victory, finishing on 12 under par, two shots clear of Tarrio and Nemecz.The 23-year-old received a last-minute invite to play at Wittelsbacher Golfclub and is ecstatic with his victory, surpassing his goal of trying to stay within the top 70 on the Road to Mallorca Rankings.“Amazing, honestly it feels amazing,” he said. “I didn’t expect it because I started the year on the Alps Tour and I only have a few wildcards for the Challenge Tour. I started really well on the Alps Tour and the Spanish Federation gave me the opportunity to play a few Challenge Tour events and I played quite well.“The first step was Italy, I finished sixth and I thought I could earn my Challenge Tour card from here and when I played in Denmark and I finished third it took all the pressure off me.“Honestly the goal was to finish top 70 this year or take the card from the Alps Tour, but this is another level and I’m so happy right now.”Hidalgo admits that compatriots Tarrio and Alfredo Garcia-Heredia, who have three collective Challenge Tour titles to their name and both finished inside the top ten this week, gave him the confidence required to earn his maiden victory.KPGA Korean Tour - The 37th Shinhan Donghae Open25-year-old Yoseop Seo moved from World No.468 to 327 after winning the 37th Shinhan Donghae Open.Professional Golf Tour of India - TATA Steel PGTI Players Championship 2021 presented by Govt. of Haryana & Panchkula Golf ClubBengaluru’s Chikkarangappa S saved his best for the last as he shot a final round of seven-under 65, the day’s joint best score, to emerge victorious by two shots at the TATA Steel PGTI Players Championship Presented by Govt. of Haryana & Panchkula Golf Club (PGC).The 27-year-old Chikkarangappa (69-65-69-65), who began the day in third place, three shots off the lead, put up a determined performance on the last day to end up with a tournament total of 20-under 268, two shots ahead of the rest at the Rs. 50 lakh event. The former PGTI Order of Merit champion had nine birdies and a double-bogey to show on his card as he wrapped up his 15th career title and 14th win on the PGTI.Gurugram’s Veer Ahlawat (67-62-71-70), the leader for the last two days, was unable to hold on to his overnight two-shot lead as he fired a 70 to finish runner-up at 18-under 270 on a day that witnessed a constant light drizzle.Yuvraj Singh Sandhu (72-67-66-67) had the best result among the Tricity golfers. The 24-year-old Chandigarh lad struck a 67 on Saturday to take third place at 16-under 272.Chikkarangappa made an early charge in round four when he drained long birdie putts on the first and third and then produced a great approach on the fifth and accurate chips on the sixth and seventh to collect five birdies on the first seven holes and draw level with leader Ahlawat.Chikka, who represented India at the World Cup of Golf in 2016, then suffered a setback with a double-bogey on the eighth where he found the trees twice. But the two-time winner on the Asian Development Tour came roaring back with two tremendous drives on the 11th and 12th that resulted in birdies and helped him restore parity with Veer.Chikka’s then excelled with his chipping and putting on the last six holes extracting birdies on the 15th and 16th that propelled him into the sole lead. He finally saw it home and picked up a cheque of Rs. 8,08,250 to consolidate himself in second position in the PGTI Order of Merit.Nordic Golf League - TRUST Forsikring ChampionshipNicolai Tinning won the TRUST Forsikring Championship moving to World No. 476 from 619.Forme Tour - Forme Tour ChampionshipOn the final hole of the final round of the final Forme Tour tournament of 2021, Brad Miller recovered from an errant drive, hit one of the top shots of his life after a recovery chip out and then made a five-foot par putt to seal the win at the Forme Tour Championship. It was Miller’s first PGA TOUR-affiliated Tour title as he defeated Travis Trace by a stroke.Holding a one-shot lead over Trace and standing on the 18th tee at Huntsville Golf Club, Miller hit his drive into the trees on the right. “That tee shot was giving me nightmares the whole week. I’ve been hitting this really nice cut driver the whole day—really the whole week. I tried to do it, and it just hung on a little too much at the end,” Miller said of his wayward drive.His tee ball was so far right that he hit a provisional, just in case. “Luckily there were a lot of people out watching, so they were able to find [the ball] pretty quickly.” After chipping back into the fairway, Miller said he “got kind of lucky.” He faced a 219-yard approach shot into the par-4 green. “That’s a perfect 4-iron number. I can swing as hard as I can,” he added. “I hit a little cut and hit it to four feet and made the putt.” That was enough to secure the win.Alsp Tour Golf - Alps de AnadaluciaStarting two strokes behind the leaders, Edgar Catherine held steady to win this year’s Alps de Andalucia at Añoreta Golf on -8 (208), three strokes ahead of the runner-up. This is his first win on the Alps Tour since the 2017 Citadelle Trophy when he was still an amateur and moves to World No. 840 from 1694.He teed off from the 11th sitting third with yesterday’s joint leaders. The French player managed to counterbalance two bogeys on the first 8 holes with an additional four birdies to put him at -5 teeing up on the ninth. A double bogey on the notoriously tricky par 4 1st set him back, but his mental game held up and he finished solidly with three extra birdies and clean pars for a 68 (-4) for the day.“I played really well, I just played my game, and it was enough to make it. My strategy for today was to play aggressively, use the driver every time I could, and it worked out well. Since the Gösser Open, where I led the tournament but made a lot of mistakes in the final round, I knew I could win and that is what I have worked for, specially mentally. Previously my game was good but not my head but now I feel it is. It is as simple as that but simple is sometimes very hard”.The win sees Edgar Catherine’s jump twelve places up the Order of Merit to seventh.EuroPro Tour - The Motocaddy MastersJack South shot a life-changing final round of 59 to claim The Motocaddy Masters title at Leven Links as well as a £59,000 bonus from the EuroPro Tour and £60,000 from sponsors Cobra Puma Golf.South started the day three shots back from overnight leader William Harrold and produced the most spectacular round in PGA EuroPro Tour history to do the unthinkable. He began with birdies at the first and second before going out in 27 to set all eyes on the Birmingham golfer as he hit the back nine having gone on a streak of five birdies from five to nine.The Tippity Green golfer continued to apply the pressure and made birdies at 11 and 12 to be nine under through 12 and two clear of Jack Davidson. Davidson had his own 59 watch earlier on and ended up signing for a spectacular round of 60 (-10) to take finish tied 3rd overall at -13.South’s work wasn’t finished knowing he needed to make two further birdies for a 59 and made one at the par 4, 14th meaning he only needed one more from his remaining four holes and that he did at the 16th. With the experienced Paul Maddy on the bag, South steered the ball home on the 17th and 18th plotting his ball 20ft from the hole knowing a two-putt would seal the 59 and bonus and that was what he did.",
  "date": "13TH SEPTEMBER 2021 | 01:00 PM",
  "description": "Billy Horschel made a stunning closing birdie to fulfil one of his great golfing ambitions and win his first Rolex Series title at the 2021 BMW PGA Championship moving back into the World Top 20 to World No.18Jacques Kruyswijk ended a five-year win drought and claim his second Sunshine Tour title in the Sunshine Tour Invitational at Centurion Country Club breaking into the World Top 200 at World No. 192.Angel Hidalgo posted four consecutive rounds of 68 to win the Big Green Egg German Challenge powered by VcG at Wittelsbacher Golfclub and claim his maiden European Challenge Tour title moving to a career best of World No. 242.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/6f918bba-70ff-4913-8b9c-160113d58e45/BH1.jpg"
},{
  "_id": {
    "$oid": "63208d53e35cd89dae0a3b48"
  },
  "title": " GOVERNING BOARD ANNOUNCEMENT",
  "__v": 0,
  "content": "The Governing Board of Official World Golf Ranking (OWGR) today announces enhancements to the Official World Golf Ranking. The updated system will incorporate modern statistical techniques which will allow all eligible players and events to be more accurately evaluated relative to each other.Over the last three years, OWGR has coordinated an independent analysis of the Ranking and its system to ensure it is meeting its key objectives of publishing a transparent, credible and accurate ranking based on the relative performances of participating players. The results of this analysis have led to the changes announced today, including distribution of Ranking Points to all players making the cut to provide greater differentiation of performances; and use of a Field Rating calculation based on a statistical evaluation of every player in the field, rather than just those in the field among the current Top-200 of the Ranking.Major Championships will continue to award 100 First Place Points, while THE PLAYERS Championship will award 80. All other tournaments will award Ranking Points according to the strength and depth of their fields, with a maximum of 80 First Place Points.Click here for additional details, Frequently Asked Questions, and definitions about the updated OWGR Ranking System.“The Official World Golf Ranking owes a massive debt of gratitude to founders Mark H McCormack and Tony Greer, whose vision has done so much to shape the competitive landscape of men’s professional golf over the past 35 years”, said Official World Golf Ranking Chairman Peter Dawson. “Since 1986, the Tours eligible for inclusion have grown in number from 6 to 23 and the rankings have been continuously modified to accommodate this expansion and to improve accuracy. We are confident the further enhancements announced today will best position OWGR for the years ahead.”Following a 12-month notice period, implementation is set for Week Ending 14th August 2022 at which point all future eligible tournaments will utilise the updated system. There will be no recalculation of past events, meaning the impact of the new methodology will be gradual.",
  "date": "11TH AUGUST 2021 | 04:30 PM",
  "description": "The Governing Board of Official World Golf Ranking (OWGR) today announces enhancements to the Official World Golf Ranking to go into effect Week Ending 14th August 2022.The updated system will incorporate modern statistical techniques which will allow all eligible players and events to be more accurately evaluated relative to each other.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/a1af832c-84bb-4cd5-91bf-5fb1da43562e/Peter%20Dawson%20Headshot.jpg"
},{
  "_id": {
    "$oid": "63208d56e35cd89dae0a3b4c"
  },
  "title": " CAMERON CHAMP MOVES TO WORLD NO.66",
  "__v": 0,
  "content": "PGA Tour – 3M OpenCameron Champ won a third PGA Tour title at the 3M open moving to a career best of World No.66.The 26-year-old Champ had five birdies in a bogey-free round to finish at 15-under 269 at TPC Twin Cities. Louis Oosthuizen, Jhonattan Vegas and Charl Schwartzel tied for second.Oosthuizen shot 66, too, in a much stronger finish than the previous weekend at the Open Championship, where his 54-hole lead turned into a tie for third after a fourth-round 71.Playing six pairs ahead of Champ, Oosthuizen birdied three of the last four holes to give himself an outside chance. His approach to the 18th green almost yielded an eagle on the PGA TOUR's hardest par-5 hole, but the ball lipped out. He made a 2 1/2 foot putt for birdie instead. Schwartzel, his fellow South African, posted a 68 to match Vegas in the final round.During another 90-degree day, Champ was far from his physical best. He felt some dizziness along the back nine, putting his hands on his knees at one point as he hung his head to try to regain some composure. He had plenty of it on the last hole, after his safe strategy with the tee shot to stay away from the lake landed way left in a trampled, sandy area directly behind a clump of trees.Champ managed to chip out onto the primary rough, then scoot up the fairway. His approach was a beauty that landed perfectly and rolled back toward the pin. He sank the easy par putt and had enough energy to pump his arms in celebration of his first top-10 finish of the year. Champ had the best putting performance of the entire field with 8.48 strokes gained.The Texas A&M product won the Sanderson Farms Championship in 2018, the year he turned pro, and the Safeway Open in 2019. He missed the cut in his last two majors this season and hadn't had a top-10 finish since tying for eighth in October in the ZOZO CHAMPIONSHIP in California.KPGA Korean Tour - YAMAHA·HONORS K OPEN with Sollago CCKorean Hanbyeol Kim moves up the Ranking 106 spots to a career best of World No. 240 with his victory at YAMAHA·HONORS K OPEN with Sollago CCThe victory is his third in eleven months since the HAZZYS Golf KPGA Open with Ildong Lakes Golf Club in August 2020.European Tour - Cazoo Open supported by Gareth BaleNacho Elvira overcame a heartbreaking bogey on the 72nd hole to beat Justin Harding in a play-off and win his first European Tour title at the 2021 Cazoo Open supported by Gareth Bale. Elvira moves to Word No.268 from 694.The Spaniard entered the final day at The Celtic Manor Resort with a six shot lead but quickly saw that eaten into as he turned in level par, with Harding, Mikko Korhonen and Callum Shinkwin all looking to deny him a wire to wire victory.A bogey on the 12th saw him caught at the top and while Elvira made birdies on the 15th and 17th, he three putted the last to sign for a 71 and finish at 16 under alongside Harding, who had carded a bogey free 65.Both men hit the green in three at the first trip back up the par five 18th and after Elvira missed a birdie chance to win it from nine feet, Harding completed a three putt from 24 to hand the 34-year-old the title.Finn Korhonen finished at 15 under after a 66, a shot clear of Englishman Shinkwin who closed with 67.Elvira's victory comes at the 195th attempt and sees him finally get over the line after three second place finishes on the European Tour, two of them coming via a play-off.With four wins on the European Challenge Tour, Elvira's class has never been in doubt, but he arrived in South Wales having not recorded a top ten for over two years and with nine missed cuts in his last 11 events.Korn Ferry Tour – Price Cutter Charity Championship presented by Dr PepperDylan Wu earned his first win and secured his PGA TOUR card at Price Cutter Charity Championship presented by Dr Pepper. The takes Wu to World No.275 from 424.Entering the day tied for the lead, Wu birdied three of his first four holes out of the gate to build the advantage. He tacked on two more at Nos. 7 and 8 to turn in 5-under 31. At one point Wu held a five-stroke lead, though that dropped to two late as last week’s champion Taylor Moore made a late charge. A weather delay halted play for more than two and a half hours from 1:45 p.m. to 4:18 p.m. as the final group was on the 10th fairway. After coming back out, he added two more birdies at the 11th and 16th holes down the stretch for the two-stroke win.“I just hung out with a few buddies,” said Wu of his time spent during the rain delay. “One of the guys was Max McGreevy, who won this last year. We were talking inside. A lot of my buddies were just saying the round's probably going to get canceled, and I don't want to hear this because I have a five shot lead right now, I don't want to go into a playoff or something like that.”The win came a month after switching caddies to his younger brother, Jeremy Wu, at the Live and Work in Maine Open. Since the switch, the Northwestern University alum has finished top-25 in three out of four events, including this victory.“He's been great; for me, having him on the bag just gave me a little more confidence in my own ability to call my own shots and play my own game,” said Wu, a former hockey star in high school. “He's kind of just there for support and to keep it chill and keep it fun while I'm playing just because golf is really stressful, playing these tournaments is really stressful, but he keeps it calm.”Challenge Tour - Italian ChallengeRicardo Gouveia won a fourth challenge Tour title at the Italian Challenge earning 12 Ranking points moving from World No. 564 to 324.PGA Tour Latino America - Bupa Championship presented by VolvoKentucky native Patrick Newcomb edged Mexico’s Oscar Fraustro on the second hole of a sudden-death playoff to win the PGA TOUR Latinoamérica season-ending Bupa Championship presented by Volvo.Trailing by two at the start of the day and playing together in the nex-to-last group, Newcomb and Fraustro pulled away from the rest of the pack with Sunday-low-rounds of 4-under 68 to finish regulation tied for first, at 5-under 283.The next-best player was Frenchman Jeremy Gandon, who carded a 71 to finish solo third, three-shots behind. At 1-under, making it a group of five players in red numbers, 54-hole leader Andrew Alligood carded a 74 to tie for fourth with 36-hole leader Ben Cook, who posted a 73.ProGolf Tour - Raiffeisen Pro Golf Tour St. PöltenAmateur Robert Foley won the Raiffeisen Pro Golf Tour St. Pölten in a playoff with his German opponent Maximilian Oelfke.Both had managed the first extra hole of the play-off with a par, but then Maximilian Oelfke missed his fifth tee shot of the tournament week on hole 18, a par 5 of only 434 metres, left into the woods. The ball landed out-of-bounds and the way to the first Pro Golf Tour title was paved for Foley.Foley earned 4 Ranking points moving from World No.1060 to a career best of 672.Forme Tour - Bolingbrook Golf Club InvitationalMac Meissner began the Bolingbrook Golf Club Invitational final round with a five-shot lead, and he said his aim was to win big. He moved ahead by seven on the back nine, and was ready to make good on his goal. Meissner eventually saw his lead shrink to two shots before he buried a 12-foot birdie putt on the 72nd hole to win the by three strokes over Canada’s Joey Savoie, who was making his Forme Tour debut.Meissner moves from unranked to World No.704 in only his fourth OWGR eligible tournament.Nordic Golf League - AUDI Finnish PGA Golf Tour ChampionshipNiclas Hellberg won the AUDI Finnish PGA Golf Tour Championship moving from unranked to World No. 848.EuroPro Tour – The ORIDA ChampionshipJack Yule has won The ORIDA Championship at Park Wood Golf Club by three shots after a final round four under 68 sealed a convincing victory for the King’s Lynn golfer.Yule led from the outset this week having carded an opening round 64 to take a share of the lead into day to before asserting his dominance on day two for a two shot advantage heading into the final round in Westerham, Kent.He started quick out the blocks going four under thru three after a birdie on 1 and 3 with an eagle on 2 eventually going out in 31 (-5). A slight wobble on the back nine though didn’t deter Yule who could’ve let the nerves get to him where at one point the lead was extended to four shots.The closest man to Yule all week was Jamie Rutherford. The Knebworth Golf Club man tried to keep pace with Yule throughout the day but in truth the damage was already done on day two by his competitor.",
  "date": "26TH JULY 2021 | 01:00 PM",
  "description": "Cameron Champ won a third PGA Tour title at the 3M open moving to a career best of World No.66.Hanbyeol Kim moved up the Ranking 106 spots to a career best of World No. 240 with a victory at YAMAHA·HONORS K OPEN with Sollago CC on the Korean Tour.Nacho Elvira overcame a heartbreaking bogey on the 72nd hole to beat Justin Harding in a play-off and win his first European Tour title at the 2021 Cazoo Open supported by Gareth Bale. Elvira moves to Word No.268 from 694.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/7582aa3f-cc78-43ab-b771-4b7e3f30cf9a/CC1.jpg"
},{
  "_id": {
    "$oid": "63208d5be35cd89dae0a3b4e"
  },
  "title": " RAHM REGAINS THE WORLD NO.1 POSITION",
  "__v": 0,
  "content": "Jon Rahm claimed his first Major Championship at the U.S Open regaining the World No.1 position. He becomes the first ever Spanish winner of the U.S Open and the fourth Spaniard to win a Major after the late great Seve Ballesteros, José María Olazábal and Sergio Garcia.The Spaniard entered the final day in California three shots off the lead but enjoyed a birdie birdie start as a host of the game's biggest names made moves on a dramatic afternoon in California.But as everyone else fell back, it came down to a two horse race between Rahm and Louis Oosthuizen, with the South African holding a one shot advantage as his rival stood on the 17th tee.Rahm then produced a finish that will go down in Major history, making a pair of birdies on his final two holes to sign for a 67 and walk off the 18th green with a one shot lead at six under with his son Kepa in his arms on his first United States Father's Day.Oosthuizen found a hazard off the tee on the 17th and the resulting bogey meant he needed an eagle up the last for a play-off, with the 2010 Open Champion making a birdie in a closing 71 that left him at five under and second in a Major for the sixth time.“I’m a big believer in karma and after what happened a couple of weeks ago I stayed really positive, knowing big things were coming,” he said.“I didn’t know what it was going to be but I knew we were coming to a special place, I knew I got my breakthrough win here and it’s a very special place for my family.“The fact my parents were able to come, I got out of Covid protocol early, I just felt like the stars were aligning.”Rahm is the first ever Spanish winner of the U.S Open and the fourth Spaniard to win a Major after the late great Seve Ballesteros, José María Olazábal and Sergio Garcia.",
  "date": "21ST JUNE 2021 | 05:00 AM",
  "description": "Jon Rahm claimed his first Major Championship at the U.S Open regaining the World No.1 position. He becomes the first ever Spanish winner of the U.S Open and the fourth Spaniard to win a Major after the late great Seve Ballesteros, José María Olazábal and Sergio Garcia.The Spaniard entered the final day in California three shots of the lead, making a pair of birdies on his final two holes to sign for a 67.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/a09bcec3-048d-4761-a486-ff11ad221a91/JR3.jpg"
},{
  "_id": {
    "$oid": "6323e648e35cd89dae0a6881"
  },
  "title": " Flawless Shane Lowry wins the BMW Championship at Wentworth",
  "__v": 0,
  "content": "WEEK 37 – 5th – 11th SEPTEMBER 2022DP World Tour - BMW PGA ChampionshipField Rating - 221.17116Shane Lowry became a two-time Rolex Series winner after edging out Jon Rahm and Rory McIlroy to end his wait for a BMW PGA Championship victory.The Irishman has long had a terrific record at Wentworth Club, coming into the week with nine top-20 finishes to his name in this event.And his love affair with the host venue continued as he carded an eagle and five birdies on Sunday to sign for a closing 65 and get to 17 under par, declaring himself \"the happiest man in the world right now\".Lowry did not card a single bogey all week on his way to victory in the 2022 season's fourth Rolex Series event, which was shortened to 54 holes after Friday's play was cancelled following the death of Her Majesty Queen Elizabeth II on Thursday.Rahm and McIlroy finished in a tie for second, one shot back on 16 under, with Talor Gooch another stroke further back.\"I'm so happy. Honestly, words can't (describe) how happy I am, how much this means to me and how much I love this Tour and how much I love this tournament. I'm the happiest man in the world right now.\"I said to my coach this morning, 'I need to just allow myself to play golf'. I'm playing the best golf of my life. I need to allow myself to do that and I did that.\"Shane Lowry Moves up to 19th from 23rd in the Official World Golf Ranking following his win at the BMW Championship winning 38.03982 points giving him a new total point tally of 209.79662Asian Tour, Japan Tour & KPGA Korean PGA Tour - The 38th Shinhan Donghae OpenField Rating - 52.49140This event is tri-sanctioned by the Asian, Korean and Japan Tours, and this year marked the first time in its history it had been played in Japan.Kazuki Higa became the first player to win three JGTO titles this season after he shrugged off stiff competition from international rivals to claim a two-shot victory. Japan’s Kazuki Higa showed just why he is currently ranked the number one player in Japan when he birdied the final two holes to win The 38th Shinhan Donghae Open at Koma Country Club on SundayOn a memorable final day at one of Korea’s premier tournaments, he holed a pressure-packed 15-foot birdie putt on the short, driveable par-four 18th to return a six-under-par 65 for a tournament total of 20 under, and a two-shot victory over Tirawat Kaewsiribandit from Thailand, Korean Mingyu Cho and Yonggu Shin from Canada.Three-time PGA Tour winner Siwoo Kim challenged for much of the day and was many people’s favourite to prevail, but he surprisingly found water on the par-four 14th and made a six before dropping another shot on the next hole.A brilliant tee shot on 18 to 20 feet, which he holed for a stunning eagle, will have been some consolation for the Korean, who will play in The Presidents Cup later this month.As well as the action on the golf course today, an important signing ceremony was held which saw officials proudly announce that the prestigious tournament, one of Korea’s flagship tournaments, will be sanctioned with the Asian, Korean and Japan Tours for an additional three years, from 2023 to 2025.Following Kazuki Higa's win, he has moved up in the Official World Golf Rankings from 88th to 75th winning 9.02813 points giving him a new total point tally of 75.51328.PGTI Professional Golf Tour of India - J&K Open 2022 presented by J&K TourismField Rating - 3.15416Yuvraj Singh Sandhu of Chandigarh stamped his authority with a resounding seven-shot win at the Rs. 40 lakh J&K Open 2022 presented by J&K Tourism played at the Jammu Tawi Golf Course.Yuvraj (69-70-65-71), the overnight leader by four shots, shot a steady one-under 71 in the last round to total 13-under 275 for the tournament and claim his fourth PGTI win and third title this season. Sandhu, who bagged the winner’s cheque worth Rs. 6 lakh, consolidated himself in second position on the PGTI Order of Merit. Bengaluru’s Khalin Joshi (70-68-70-74) secured the runner-up spot at six-under 282 after firing a 74 in round four. Gurugram’s Manu Gandas (67) took third place at three-under 285. Chandimandir’s Ravi Kumar shot the day’s best score of 66 to clinch 11th place at two-over 290.Yuvraj Singh Sandhu, who had shot the tournament’s best score of 65 earlier in round three, continued his domination in round four to ease to a comfortable win at PGTI’s first-ever event staged at the Jammu Tawi Golf Course (JTGC).Yuvraj said, “I was a little nervous coming into this week because I had played well off late but not scored well at the Asian Development Tour (ADT) events in Indonesia. So I felt I just needed a little reassurance.“My father gave me a surprise this morning by arriving in Jammu. Seeing him at the golf course before my round today really helped me relax. I then just wanted to follow the yardage book, keep it in play and find fairways and greens. I managed to do that well today.“The nine-foot birdie conversion on the 13th was the point when I thought I had the match in the bag. The highlight of the week for me was my good course management with my caddie Sonu contributing a lot to it. You have to be 100 per cent committed on this course and that’s what I did for the most part of the week.“I realized when I went to Indonesia to play on the ADT, I felt a little void because my regular caddie Sonu wasn’t there. He’s not just my caddie but like a younger brother to me. He has played a big part in my performance this week.”Following Yuvraj Singh Sandhu's win, he has moved up in the Official World Golf Rankings from 399th to 392nd winning 0.56842 points giving him a new total point tally of 18.71276.Sunshine Tour - Gary & Vivienne Player ChallengeField Rating - 12.20677Jaco van Zyl is close to getting back to his best as he ended a six-and-a-half-year winning drought by claiming the Gary and Vivienne Player Challenge title at Selborne Park Golf Club on Saturday.Van Zyl began the final round with a one-stroke lead and finished strongly to shoot a three-under-par 69 and post a 14-under-par winning total, finishing two shots clear of Hennie Otto.In a thrilling finish, Otto was close behind but a bogey at the par-four 13th and then a string of pars coming in saw the veteran fall just short after a final day 70.“I was playing nicely the whole time and I felt I was hitting really good putts but they just weren’t going in,” Van Zyl said. “I actually made a seven-footer for bogey on 14, and it sounds strange, but that got me some momentum.“On 15 I sank a big putt that turned 15 feet off the left and that really got the confidence going. Then I hit a great wedge on 17 to about two feet, and to have a two-shot lead on the 18th hole is always nice.“I’m over the moon with the win, it’s been a rocky road and I’ve been fighting a lot of demons. So it’s a real sense of accomplishment. In golf, it’s a case of how well you are doing both on and off the course, and I can sense I am on the right track,” Van Zyl said after his 16th Sunshine Tour win and his first title since triumphing at the Eye of Africa PGA Championship in February 2016.To win an event bearing the Gary Player name was also a tremendous joy for 43-year-old Van Zyl.“Gary was our team captain at the Rio Olympics in 2016, which was very special for me. I spent quite a bit of time talking with him in Rio and it’s really nice to now win his tournament,” Van Zyl said.Van Zyl is now up to 14th in the Luno Order of Merit and is going to be taking renewed confidence into the lucrative summer events on tour.Following Jaco van Zyl's win he has moved up in the Official World Golf Rankings from 949th to 769th winning 2.32332 points giving him a new total point tally of 6.76461.EuroPro Tour - Spey Valley Golf ResortField Rating - 5.93463Stuart Grehan was crowned a PGA EuroPro Tour champion for the first time in his career; the golfer has moved to 9th in the Order of Merit. Grehan also moves further up in the Official World Golf Rankings following his win, moving from 1832nd to 1476th winning 1.06949 points giving him a new total point tally of 1.37706.Due to Thursday’s torrential weather, the Spey Valley Championship was transitioned into a 36-hole event as opposed to the traditional 54. Before play resumed on Friday morning, the tour held a two-minute silence to commemorate the death of our devoted and beloved Queen.Following the conclusion of the second (Final) round, a three-man playoff began as both Stewart and Grehan were looking for their maiden victories on this tour. Due to the layout of Spey Valley Golf Club, the referees had agreed that the two playoff holes would be the 1st and 18th, which lie adjacent to one another.Stewart had a fantastic opportunity of closing out the tournament on the very first playoff hole, but his four-foot putt failed to find the cup. After three playoff holes, Grehan and McElroy found birdie to eliminate Stewart – who congratulated the pair immediately after his fate was confirmed.The playoff would last seven holes before Grehan secured birdie at the 1st to earn his first EuroPro victory.Nordic Golf League - BMW Onsjö OpenField Rating - 5.49766Frederik Tøttenborg accomplished his first victory on the Nordic Golf League at the BMW Onsjö Open in Denmark, holding on to the finishing line with a score of 70 in the last round. The victory was Frederik’s by three strokes ahead of the runner-up.This win moves Frederick up in the Official World Golf Rankings from 2082nd to 1593rd winning 1.01545 points giving him a total of 1.08587 points.",
  "date": "12TH SEPTEMBER 2022 | 07:00 AM",
  "description": "Shane Lowry became a two-time Rolex Series winner after edging out Jon Rahm and Rory McIlroy to end his wait for a BMW PGA Championship victory.",
  "image": "https://assets-us-01.kc-usercontent.com/00be6aeb-6ab1-00f0-f77a-4c8f38e69314/5eac4a70-f158-4f20-bf1e-a80ceda6e20e/Shane%20Lowry%20BMW%20Champ.jpg?w=315&h=210&fit=clip&rect=0,12,5482,3654"
},{
  "_id": {
    "$oid": "63273663e35cd89dae0ac517"
  },
  "title": "IMPORTANT ANNOUNCEMENTOWGR LAUNCHES MODIFIED RANKING SYSTEM",
  "__v": 0,
  "content": "The Governing Board of Official World Golf Ranking (OWGR) today announces that the enhancements to OWGR's system revealed in August of 2021 are now in effect after a 12-month notice period. The updated system incorporates modern statistical techniques, which allows players and eligible tournaments to be more accurately evaluated relative to each other.Beginning in July 2018, OWGR coordinated an independent analysis of the Ranking and its system to ensure it is meeting its key objectives of publishing a transparent, credible, and accurate ranking based on the relative performances of participating players. The result of this analysis led to the changes announced in August of 2021, including the distribution of Ranking Points to all players making the cut; the use of a Field Rating calculation based on a statistical evaluation of every player in the field rather than just those in the field among the current Top-200 of the Ranking.Major Championships will continue to award 100 First-Place Points, while THE PLAYERS Championship will award 80. All other tournaments will award Ranking Points according to the strength and depth of their fields, with a maximum of 80 First-Place Points.Click here to watch a video on how the Ranking System worksClick here for additional details and Frequently Asked Questions, about the modified OWGR Ranking System.As part of the system implementation that begins on August 8th, OWGR has launched a new website and logo.\"Through the work undertaken by the OWGR Technical Committee, coordinated by a subcommittee comprised of representatives from the Asian Tour, DP World Tour, PGA of America, PGA TOUR, R&A, and Sunshine Tour, The Official World Golf Ranking has undertaken a rigorous process of analysing and developing the changes implemented today,\" said Official World Golf Ranking Chairman Peter Dawson. \"We are confident these enhancements will best position OWGR for years to come.\"All future eligible tournaments will utilise the updated system, and there will be no recalculation of past events, meaning the impact of the new methodology will be gradual.",
  "date": "9TH AUGUST 2022 | 04:00 PM",
  "description": "The Governing Board of the Official World Golf Ranking (OWGR) today announces that the enhancements to OWGR's system revealed in August of 2021 are now in effect after a 12-month notice period. The updated system incorporates modern statistical techniques, which allows players and eligible tournaments to be more accurately evaluated relative to each other.",
  "image": null
},{
  "_id": {
    "$oid": "632973cbe35cd89dae0b336b"
  },
  "title": "Championship Mindset presented by AXA XL: Horacio Morales",
  "__v": 0,
  "content": "After winning her third LPGA Tour event, the Dana Open presented by Marathon, Mexican Gaby Lopez recognized once again the support of her family, friends, and coaches. She also elaborated on her mental work and struggles.“Sometimes the biggest win is not winning over the field. It is winning against yourself and getting out of the way. It is overcoming those fears, overcoming those battles, those doubts, because you don’t believe in yourself, and you are in a hard stretch,” said 28-year-old Lopez, currently number 39 in the Rolex Women’s World Golf Rankings.“The biggest win is being able to recover from two injuries I had at the beginning of the year,” added Lopez about her recovery from a neck injury and tendonitis on her wrist. “That sets you back and you start doubting even more if you can come back with more speed and consistency.”She came back physically and mentally stronger to earn her first victory since January 2020.  Following a journey of recovery along with her team and her longtime coach, Horacio Morales, has never doubted Lopez’s potential.“You set an example as a person, as a professional and as a friend. You are the pride of Mexico. I am delighted to have walked the path with you and that you let me help you on this journey,” said Morales in his congratulatory message to his oldest pupil.In fact, Morales has become an institution and an essential component of the engine that propels women’s golf in Mexico. In addition to coaching Lopez, Morales also works with four of the six Mexicans in the Epson Tour: Fernanda Lira, Regina Plasencia, Ingrid Gutiérrez, and María Balcazar.“This is the training base for them,” said Morales describing his avant-garde studio at Club de Golf de Chapultepec, in Mexico City, where he tirelessly learns and applies new technologies and theories. “We work with the experts who have inspired me,” adds Morales, once a young aspiring professional golfer under the wing of Rafael Alarcon, Lorena Ochoa’s renowned coach.“When I traveled to tournaments with Alarcon, he used to have these long phone conversations with Lorena about attitude, commitment to the shot, positive mindset, visualizing. Lorena was number one and I never made it past 1,000 in the world, so I became a coach,” remembers Morales about his initial exposure to mental work in golf.Those conversations with Alarcon launched a decade of exploration into the mental side of golf and sports in general, from the work of Pia Nilsson and Lynn Marriott with Vision 54 to interactions with world champion boxer Canelo Alvarez, an avid golfer and applied golf student. Canelo told Morales about his mindset during his legendary victories with a broken hand.As he keeps learning, these days Morales has not one, but two psychologists from different backgrounds working with his players. On the one hand, Claudia Rivas, the first woman psychologist in Mexican soccer and credited by the Club Puebla fans with the mental strength and revival of their team, brings the female perspective and her understanding of Latinas’ strong emotions.“We work on controlling the emotions on the golf course, particularly the reactions,” said Morales about what Gaby Lopez described as “staying quiet and patient, getting rid of all the drama.” This taming of the reactions has been a winning formula for Lopez and a product of her work with Rivas and Steve Yellin.“I pretty much reset my whole kind of mental game. I spent some time with Steve just creating more quiet moments and quiet spaces out there so I can flow a little bit more,” said Lopez about her preparations for the Dana Open with Yellin, creator of Fluid Motion Factor and the other mental coach helping Morales’ players.“The mental coaches help them do the things they need to know themselves better, deal with anger and anxiety, stay present. However, at the end of the day, the technical and mental aspects are connected. You don’t hit the golf ball with your head,” clarified Morales with a smile.He explained, for instance, how the technical work on shot dispersion is a very important mental tool for his players. “Knowing their percentages on the course and recognizing their margin of error increases and accelerates their tolerance and acceptance during competition,” said Morales, always willing to accept responsibility for their mistakes.“The most important job of a coach is to make them realize things by themselves. Like they say in sports in Mexico, when they win, they are the good ones, and when they lose, the coach is the bad one,” added Morales, who is still celebrating Gaby Lopez’s third victory on the LPGA.",
  "date": "19Sep2022",
  "image": "https://www.lpga.com/-/media/images/lpga/landing-pages/axa-xl--volunteer-service-award/2022/horaciogaby116x9.jpg?h=576&la=en&w=1024&hash=0F6394A764258E7CD097D55BCB374349B7C030AC",
  "topic": "gaby-lopezAXA Championship Mindsetlpga-360"
},{
  "_id": {
    "$oid": "632973cee35cd89dae0b3370"
  },
  "title": "LPGA Tour Heads To Arkansas Now With 9 Rolex First-Time Winners",
  "__v": 0,
  "content": "Andrea Lee held off a charging pack to become the ninth first-time winner of the season with her victory at the AmazingCre Portland Classic on Sunday.Lee, a third-year member on the LPGA Tour, made an uneasy transition from an illustrious amateur career at Stamford University to the LPGA Tour during the COVID-shortened season of 2020. For a time, she was the top-ranked amateur in the world and one of the most decorated athletes in Stanford’s history. But she struggled to convert her collegiate success into professional prowess and was forced to return to Q-Series in order to retain her card. Lee began to find her footing in 2022 as she recorded three top-5 finishes ahead of her breakthrough win, which she captured with a final round 66 on Sunday.“It's a huge weight off my back,” Lee said after her maiden victory. “The goal was to be in contention and try to win an LPGA Tour event. And now that I did that, yeah, it's kind of like a sigh of relief. I still want to win more now that I've won one. Just want to keep on doing it.”Four weeks into a six-week string of events which crisscross the United States, the LPGA Tour makes its next stop at the Walmart NW Arkansas Championship in Rogers, Ark. where players will compete for a $2.3 million purse.Since 2007, Pinnacle Country Club has annually attracted the best in the women’s game with eight former world No.1s winning in Arkansas throughout the tournament’s history - Jiyai Shin (2009), Yani Tseng (2010, 2011), Ai Miyazato (2012), Inbee Park (2013), Stacy Lewis (2014), Lydia Ko (2016), So Yeon Ryu (2017), and Sung Hyun Park (2019).The Arkansas faithful have been proud supporters of the championship and brought a lot of fun to the event with their Woo Pig Sooie chant known as The Hog Call, particularly at the par 3, 17th hole where players often take part in the chant as they walk from tee to green. And each year, the University of Arkansas’ women’s golf program has taken advantage of the opportunity to compete alongside and learn from the best players in the world. In 2022, two tournament sponsor invitations have been given to members of the program, Brooke Matthews and Kajal Mistry. Former Razorbacks Gaby Lopez, Maria Fassi, and Lewis are also in the field.Beginning Friday, the 54-hole event will once more feature the best in the women’s game with Nelly Korda as the top-ranked player in the field. Current world No. 1 Jin Young Ko remains sidelined with a wrist injury which has plagued her since last season. The field also features two dozen major champions including Ariya Jutanugarn, Lexi Thompson, Minjee Lee, Sei Young Kim, Jennifer Kupcho, and returning past champions in Lewis, Ryu, Lydia Ko, and Sung Hyun Park.Nasa Hataoka, one of only two players ranked inside the top 10 in the world who has yet to win a major championship, returns as a defending champion. Hataoka, a two-time winner of the event in 2018 and 2021, made a hole-in-one in both the first and second rounds en route to her victory last season. Fans will await to see whether she has another ace up her sleeve as she seeks to become the first three-time winner in Arkansas.",
  "date": "19Sep2022",
  "image": "https://www.lpga.com/-/media/images/lpga/tournaments/portland-classic/2022/rd4/leea_1425025710_2000x1125.jpg?h=1125&la=en&w=2000&hash=A81035320538E98C89407C3660493E026710AE35",
  "topic": "walmart-nw-arkansas-championship"
},{
  "_id": {
    "$oid": "632974cee35cd89dae0b3444"
  },
  "title": "Liwski, Kulig Crow, Williams-Hoak and Sugiyama Receive 2022 LPGA Professionals National Awards",
  "__v": 0,
  "content": "Gia Liwski is Teacher of the Year, Marissa Kulig Crow is Professional of the Year, Debbie Williams-Hoak is Coach of the Year and Satomi Sugiyama is Junior Golf Leader of the YearDAYTONA BEACH, Fla., Sept. 19, 2022 – The LPGA Professionals announced today the following members as winners of the 2022 national awards in acknowledgement of their dedication and achievements: Gia Liwski, Fiddler's Elbow Country Club & Golf Experiences for Her® in Bedminster, NJ, Teacher of the Year; Marissa Kulig Crow, Lyman Orchards Golf Club in Middlefield, CT, Professional of the Year; Debbie Williams-Hoak, Saline High School in Saline, MI, Coach of the Year; and Satomi Sugiyama in Tokyo, Japan, Junior Golf Leader of the Year.The national award winners were selected by the LPGA Professionals membership’s Executive Committee from the pool of Section Award winners voted on by officers of the six regional sections: Central, International, Midwest, Northeast, Southeast and Western.Teacher of the Year, Gia LiwskiThe LPGA established the National Teacher of the Year Award in 1958. The award is given annually to the female golf professional who has demonstrated outstanding accomplishments related to the teaching of golf during the year.Liwski has been an LPGA Professionals Class A member since 2001, and she is currently a teaching professional at the Fiddler's Elbow Country Club in Bedminster, NJ. She has been teaching golf for more than 20 years helping countless students improve their game.  While looking to better serve her clients in 2016, she founded Golf Experiences For Her®, an enterprise focused on golf and lifestyle-centered events created to break down the “golf is so challenging” mentality and to help women gain the confidence to accept their next golf invitation while discovering fun in the game.She consistently works to find ways to combine her life’s passions of mentorship and entrepreneurship; and even after launching her business, Liwski has maintained her commitment to teaching.  She prides herself on establishing a student-focused approach always creating a relaxed and open learning environment leaving her students confident and playing better.With an impressive list of distinctions as a top golf instructor, Liwski has been nominated for the Nancy Lopez Award in 2021 and 2022.  She was also recognized as an LPGA Top 50 Instructor from 2019-2023, consecutively. She was named Northeast Teacher of the Year in 2020 and was awarded Golf Digest Top 40 Under 40 in 2014 & 2015.  She was among the top four in 2021 for Golf Digest Best of State (NJ) and was included among Golf Digest Best of State (NJ) from 2017 – 2021.Liwski is heavily involved with the LPGA Professionals organization.  She serves as the Chair of the LPGA National Media and Marketing Committee since 2020, spoke at the LPGA National Conference in 2021 and recently completed coaching at her sixth LPGA Leadership Academy.“Winning the LPGA National Teacher of the Year is the highlight of my career,” said Liwski.  “I am truly humbled to receive this recognition, particularly in light of all the great female instructors who I share this award with.  It's an honor to have been selected and it means the world to me.”Professional of the Year, Marissa Kulig CrowThe LPGA Professional of the Year Award was established in 1980 and is awarded annually to an LPGA Professionals member primarily engaged in a golf operation, golf association or industry position, promoting the game through player development, growth of the game initiatives and other golf-related activities.Kulig Crow has been an LPGA Professionals Class A member since 2017 and has spent the last ten seasons as Director of Women’s Instruction at the Golf Center of Lyman Orchards in Middlefield, Conn, recognized as the #1 women’s program among the more than 100 programs that Troon Golf offers for women nationwide.After more than 28 years in the golf business, Kulig Crow has held various positions ranging from greenskeeper, assistant golf professional, head golf professional, to General Manager and more.As the creator of the Golf Fore Women program, she has helped over 5,400 women improve their golf game since 2013, reaching more than 2,000 female participants this year alone.  She has established a student-centered methodology ensuring her students feel welcome and at ease from day one. Over the years, her programs have grown exponentially attracting more women to the game and even more qualified teaching professionals to her club generating four times the facility revenues since 2017.  Her teaching program has become the main pipeline to the ladies’ golf league comprised of more than 280 female golfers who play more than 275 rounds per week.She is also a certified Callaway Club Fitter, Frankly Golf Putting Instructor, CardioGolf Trainer and Katherine Robert’s Level I Yoga for Golfers Instructor, incorporating her eclectic skills into her clinics, individual instruction, and group classes. In her decades as a teaching professional, she served as a golf instructor for Jane Blalock’s Golf for Women Clinics for five seasons and instructed clinics for the Executive Women’s Golf Association (now LPGA Amateur Golf Association) for nine years between 2003-2012.Outside of her responsibilities at Lyman Orchards, she is also an LPGA*USGA Girls Golf Site Director and donates her time to serve as a volunteer golf instructor for local afterschool junior programs.Kulig Crow was most recently awarded the 2021 LPGA National Teacher of the Year.  She was the recipient of the LPGA Northeast Teacher of the Year in 2019 and 2021. She also received the 2021 Golf Range Association of America Top 100 Growth of the Game Teaching Professionals and the 2021 Golf Fitness Association of America Award Winner.\"I'm speechless and in awe receiving this tremendous honor. To be chosen among the extremely talented, dedicated professionals within this wonderful organization makes me feel truly humbled,” expressed Kulig Crow.  “I share this award with my facility Lyman Orchards, the most supportive General Manager, Jason Beffert, and my entire work family.  I will continue to work hard, share our successes, and keep growing this great game we all love.\"Coach of the Year, Debbie Williams-HoakThe LPGA Professionals Coach of the Year Award was established in 1980 and is awarded annually to an LPGA Professionals member who is actively engaged in teaching and/or coaching golf at the collegiate or high school level.LPGA Professionals Class A member Debbie Williams-Hoak knows what it takes to compete at the highest levels.  She is a former LPGA Tour Player and Track & Field athlete who represented U.S. Track and Field in Russia and West Germany.  She is a 4 time Big Ten Champion, a member of the Ohio Track & Field Hall of Fame, University of Michigan Women’s Track Hall of Fame member and a member of the Michigan Golf Hall of fame as a player, coach and teaching professional.  This year, she is being inducted into the University of Michigan Athletic Hall of Honor.Having been a multi-sport athlete accustomed to competing at the highest level, Williams-Hoak brings something unique to her coaching style.  She has successfully coached boys and girls golf for the past 16 years at Saline High School in Saline, Michigan, currently serving as the first female President of the Michigan Interscholastic Golf Coaches Association.  Williams-Hoak feels proud that every girl on her team shot career lows while maintaining 100% academic eligibility this season, while her boys’ team placed 2nd in the Conference Championship and qualified for their 2nd straight State Finals appearance.She is dedicated to instilling a lifelong love of the game while empowering students through golf and hopes her example will pave the way for other women coaches to lead as well.Williams-Hoak received the 2017 Sandy LaBauve Spirit Award, the most coveted honor bestowed by LPGA*USGA Girls Golf, for her continued dedication and passion for empowering girls through golf.  She was honored with the Midwest Youth Leader of the Year and Goldie Bateson Award winner two times, in addition to numerous recognitions as Coach of the Year from Saline High School.She is deeply involved with the LPGA Professionals organization, where she currently serves as the LPGA Midwest Secretary since 2021.  She has been Site Director for LPGA*USGA Girls Golf of Greater Washtenaw Country since 2015 and acted as an advisor for the Site Director Certification program in 2021.  From 2018-2021, she worked as an Expert Committee member for LPGA*USGA Girls Golf.  She also coached at the LPGA Leadership Academies in Michigan over the last two years.\"I am extremely humbled by this award, as there are so many outstanding LPGA coaches in our association. What an honor to represent the LPGA, the state of Michigan and the game of golf as a coach,” said Williams-Hoak.  “It is a privilege to work with so many wonderful players who make coaching so rewarding. I am also fortunate to have such great fellow coaches in Michigan and throughout the LPGA. Thank you so much for this very special recognition.\"Junior Golf Leader of the Year, Satomi SugiyamaThe LPGA Professionals Junior Golf Leader of the Year Award was established in 2012 and is awarded annually to an LPGA Professionals member who excels in teaching and promoting golf for juniors.Satomi Sugiyama has been an LPGA Professionals Class A member since 2019.  She is the Founder/CEO and Director of Instruction of the Sugiyama Global Education Inc. and Satomi Kids Golf Academy with three locations in Tokyo, Japan.Sugiyama discovered her passion for golf when she first played at age 26.  Three years later, she decided to leave her corporate job and dedicate herself to a one-of-a-kind program in Japan.  She launched her first SNAG golf lessons in a dance studio for kids over the age of three and has spent the last 11 years teaching junior golf at elementary schools across Japan. She enrolled more than 824 students ages 6-12 in a year increasing the number of girls by 60% and helping to make the game more accessible to young children.  She prides herself on the diverse makeup of her students and believes children growing up in Japan should live a spiritually rich social life respecting each other and celebrating language and cultural differences. Her golf academy was selected as one of the best junior golf schools in Japan in 2020 and 2021.As Class A LPGA member, she was the first Japanese to obtain the following qualifications: U.S. Kids Golf Coach, the Positive Coaching Alliance (PCA) Double-Goal Coach, Little Golf T.R.A.I.N. certified Conductor, Colour Path Golf Certificate Coach, and CardioGolf Certified Trainer and Ambassador. She has been a Site Director for LPGA*USGA Girls Golf in since 2019 and completed her online certification in 2020.  She spares no effort to educate children.She keeps working to promote the many benefits of being an LPGA Professionals to the Japanese golf industry and has served as an official LPGA Ambassador in Japan from 2019-2020. In 2020, she won the LPGA Professionals International Section Junior Leader of the Year award.''I am truly proud to be a part of this outstanding organization and am deeply honored to receive this prestigious award.  I cannot tell you how much this recognition means to me,” said Sugiyama.  “I would like to extend my eternal gratitude to everyone at the LPGA. I remain committed to contributing to the development of junior golf in Japan and around the world. I hope I can up to your expectations and further advance the success of such an amazing organization.''",
  "date": "19Sep2022",
  "image": "https://www.lpga.com/-/media/images/lpga/tcp/releases/2022/091922_professional-announcement-2000x1125.jpg?h=1125&la=en&w=2000&hash=37EFCE451817868A43B7E2F0339FED9A990FD3EA",
  "topic": "lpga-professionals"
},{
  "_id": {
    "$oid": "632974d1e35cd89dae0b3446"
  },
  "title": "Andrea Lee Captures First Victory at AmazingCre Portland Classic",
  "__v": 0,
  "content": "It was anyone’s tournament going into the final round of the AmazingCre Portland Classic and it remained that way throughout the day at Columbia Edgewater Country Club. With numerous lead changes and a myriad of elite players clawing their way to the top of the leaderboard on Sunday, a clear champion wasn’t established until the final putts. That champion is Andrea Lee, who finished at -19 and earned the first win of her LPGA Tour career.“All the hard work has paid off. It's been my dream to win on the LPGA Tour, and the fact that I accomplished that today is just pretty surreal,” the Rolex First-Time Winner said. “Some of the past champions (of the Portland Classic) are legends of the game… I'm extremely honored to join that list of names.”Lee started the day at -13 and in the lead group alongside fellow Epson Tour graduate Lilia Vu and 2022 first-time winner Ayaka Furue. She got off to a rough start with two bogeys in her first three holes but turned it around shortly after with birdies on holes five, six and seven. The American continued the birdie barrage with five on the back nine and took advantage of Columbia Edgewater’s four par-5s throughout the round, birdieing every single one.Lee had a two-stroke lead at -19 going into the final two holes, but she struggled on the par-4 17th after her ball landed in a fairway divot.“It was a bad break obviously, but nothing you could do about it. I was kind of in between clubs. I was debating whether I should hit a really full 7-iron or choke-up 6-iron, and I went with choke-6 and tugged it a little,” Lee explained. “I caught it pretty clean. I think if I aimed it a little bit more right it would've been on the green. But tugged it and went in the bunker. I just had to keep myself calm and try and get it up and down. Hit it to about a foot so that definitely helped calm the nerves.”Lee’s spectacular sand save allowed her to maintain the two-stroke lead going into the final hole. Ecuadorian Daniela Darquea, playing one group ahead, put the pressure on Lee with a birdie on No. 18 to reach -18. But Lee said she remained calm, avoided focusing on the leaderboard and finished with a routine par that made her an LPGA champion.Looking at Lee’s final stats, it’s easy to see how she became a champion. The Stanford alumna led the field in birdies and hit the most fairways and greens in regulation. Her game is the best it’s ever been, she said, but it’s been a long journey to reach this point.“My junior career and my amateur career have always been kind of smooth sailing I would say. I kind of expected a lot out of myself coming into the LPGA and turning professional. Put a lot of pressure on myself to do really well off the bat,” said Lee, who is tied for the title of winningest golfer in Stanford history. “That wasn't the case at all. 2020 was a decent year, but then 2021 was a struggle… Just learned from all those experiences last year, and I really have grown as a golfer and really proud of the way that I managed to use all those experiences to get that win today.”Darquea’s second-place finish is her best on the LPGA Tour. Her previous best was a tie for fifth at the 2018 Dana Open presented by Marathon. The 27-year-old lost full status on the LPGA Tour coming into 2022 but has used her Epson Tour membership to help improve her game and build her confidence at the five LPGA events she has played this season. In fact, Darquea was debating whether to even play in Portland this week or play on the Epson Tour. She said she made the right choice.“It was rough at the beginning of the year, losing the card, going back to Epson,” said Darquea, who shot seven birdies and a bogey on Sunday to earn her second-place spot. “I know I have the game to be here. I just need to keep the mental game going as it is.”Five players share the third-place position, including third-round co-leaders Furue and Vu, 2019 Portland Classic champion Hannah Green, German golfer Esther Henseleit and Korean Narin An. An’s bogey-free 64 allowed her to jump up the leaderboard from T14 to T3. Her -8 round was only bested by Bianca Pagdanganan, whose 9-under 63 was the best 18-hole score of the week at Columbia Edgewater. Making her LPGA Tour membership debut, Maja Stark earned an eighth-place finish with a 6-under final round that saw her in an early lead after five consecutive birdies at holes 4-8.",
  "date": "18Sep2022",
  "image": "https://www.lpga.com/-/media/images/lpga/tournaments/portland-classic/2022/rd4/leea_1425027411_2000x125.jpg?h=1125&la=en&w=2000&hash=A5CE14B94478E47052866A4C7BCA82A7ACE54CCB",
  "topic": "Andrea Leeportland-classicamazingcre-portland-classicTournament News"
},{
  "_id": {
    "$oid": "632974d6e35cd89dae0b344b"
  },
  "title": "Daniela Darquea Thrilled by Portland Runner-Up Finish",
  "__v": 0,
  "content": "There might not be anyone who has ever been happier with a runner-up finish than Daniela Darquea on Sunday in Portland. The 27-year-old native of Quito, Ecuador, has bounced between the LPGA and Epson Tours after a difficult 2021 season that saw her make just five of 18 cuts. In fact, the AmazingCre Portland Classic was just her fifth LPGA Tour start of 2022, with two top-15s and two missed cuts.“It was rough at the beginning of the year, losing the card, going back to Epson,” Darquea said. “Literally I had probably one or two chances in Dow that I started playing pretty good out here. Had a few good events and then all of a sudden I was like, okay, should I pick the Epson? Should I pick the LPGA?”This week, she chose to make the trip West to Portland. And she made the most of the opportunity. Darquea closed with three consecutives birdies at Columbia Edgewater Country Club to reach -18 and leave with a solo second finish. Her $139,217 paycheck is more than she’s ever made in a single season and is nearly half of her career earnings. And though the money is nice, Darquea focused on the confidence boost she will take from her career best finish on the LPGA Tour, remebering the struggles of the past and the promise of the future.“You have no idea how much I learned this year, this past two years,” she said with relief vividly etched onto her face. “Last year was such a struggle, and now being able to stay in the moment, stay calm, like execute the shots, take it one shot at a time, if I get in trouble, get out of trouble quick, it's big. It's very important. Obviously I'm excited for what is to come.”",
  "date": "18Sep2022",
  "image": null,
  "topic": "Daniela Darqueaamazingcre-portland-classicportland-classicTournament News"
}]